Repository: julienmalard/Marksim
Catalog: دستاویزات/source/_locale/cak/LC_MESSAGES/nmune/mrksm5.po
Languages: cak

source: مرکسم ۵ کا استعمال
cak: Rukusaxïk Marksim 5

source: مرکسم ۵ آب وہوا کی تبدیلیوں کے خاکے کے لحاص سے آب وہوا کے کوائف دیتا ہے۔ مرکسم جالبین میں ہے اور آپ اسکو اپنے تخمینہ کار پر بھی تنصیب کر سکتے ہیں۔
cak: Marksim 5 nuya' rutzij ruwäch q'ij kichin ri taq chojmil jaloj ruwäch q'ij. Marksim k'o pa ruya'l kemtz'ib', yattikïr chuqa' nanimoj pa akematz'ib'.

source: تقدیر دونوں سے کوائف ڈھونڈ سکتا ہے، پر تخمینہ کار پر موجود مرکسم ھمیشہ جالبین کے مرکسم سے تيز ہو گا۔ اسی لئے، اگر آپ مرکسم پر زيادہ کام کرنے والے ہیں،تو بہتر ہوگا کےآپ اپنے تخمینہ کار پر مرکسم تنصیب کریں۔
cak: Taqdir nitikïr nukanoj tzij pa ri ka'i', po rukusaxïk rokisanem Marksim pa akematz'ib' jantape chanin xtel chuwäch rukusaxïk ri Marksim richin ruya'l kematz'ib'. We k'o k'iy asamaj nawajo nab'an rik'in Marksim, ütz' nanimoj rokisanem Marksim pa akematz'ib'.

source: جالبین مرکسم کا استعمال
cak: Rukusaxïk Marksim 5 richin ruya'l kematz'ib'

source: آپ کو کچھ کرنے کی ضرورت نہیں۔آّپ صرف مقام اور خاکوں کا ت‏عين کريں۔ اگر آپ کا تخمینہ کار جالبین سے منسلک ہے،تو تقدیر خود ہی اعدادوشمار لے گا۔
cak: Ütz chïk ronojel. Xaxe rajwaxïk nab'ij chire Taqdir achike k'olibäl chuqa' chojmil nawajo. We k'o atununem ruya'l kematz'ib', Taqdir xtukanoj pa yon ri tzij nawajo.

source: تخمینہ کار پر مرکسم کا استعمال
cak: Rukusaxïk Marksim pa akematz'ib'

source: پہلے مرحلہ ميں آپکو اپنے تخمینہ کار پرمرکسم کی تنصیب کرنی پڑیگی۔ بعد میں تقدیر کو مرکسم کا راستہ بتانا ہے تاکہ وہ جان سکے کہ آپکا مرکسم کہاں رکھا ہے:
cak: Nab'ey rajwaxïk nanimoj rokisanem richin Marksim pa akematz'ib'. K'a ri' rajwaxïk chi nab'ij chire Taqdir akuchi rochochib'äl Marksim xatyaka' pa akematz'ib'.

source: from تقدیر.ذرائع.مرکسم۵ import راستہ_مرکسم_بتانا راستہ_مرکسم_بتانا('~میرا/مرکسم/ہے/یہاں/marksim.exe')
cak: from تقدیر.ذرائع.مرکسم۵ import راستہ_مرکسم_بتانا as rujuuxïk_rochochibäl_marksim rujuuxïk_rochochibäl_marksim("~nu/marksim/wawe/k'owi/marksim.exe")

source: مرکسم کے خاص نمونے
cak: Kikusaxïk jujun k'utb'äl richin Marksim

source: مرکسم ۵ میں ۱۷ مختلف آب وہوا تبدیلیوں کے نمونے ہیں۔ عام طور پر ہم تمام کا استعمال کریں گے۔ پر اگر آپکو خاص نمونوں کا استعمال کرنا ہے تو آپ مرکسم کے ذریعے بتا سکتے ہیں کے آپکو کون سے نمونے درکار ہيں۔ یہ طريقہ جالبین اور تخمینہ کار کے مرکسم دونوں کے لئے کارآمد ہے۔
cak: K'o 𝋱 (17) taq k'utb'äl richin jaloj ruwäch q'ij chupam Marksim 5. K'iy b'i'aj xtawajo' nakusaj konojel, po we k'o jun romal xaxe nawajo nakusaj jujun taq k'utb'äl, yattikïr nab'ij chire ruxe'el tzij richin Marksim (richin ruya'l kematz'ib' chuqa' richin okisanem kematz'ib') achike taq k'utb'äl nawajo nakusaj.

source: from تقدیر.ذرائع import مرکسم۵, مرکسم۵_جال, ناسا from تقدیر.مقام import مقام میرا_مقام = مقام(عرض=11.02, طول=76.96, بلندی=1) نمونہ = '۰۰۰۰۰۱۰۰۰۰۰۰۰۰۰۰۰' ذرائع = (مرکسم۵(نمونہ=نمونہ), مرکسم۵_جال(نمونہ=نمونہ), ناسا()) کو = میرا_مقام.کوائف_پانا(سے='۲۰۵۰۰۱۰۱', تک='۲۰۶۰۰۱۰۱', ذرائع=ذرائع)
cak: from تقدیر.ذرائع import مرکسم۵ as Marksim5, مرکسم۵_جال as Marksim5_yal, ناسا as NASA from تقدیر.مقام import مقام as kolibäl nukolibäl = kolibäl(عرض=11.02, طول=76.96, بلندی=1) kutbäl = '۰۰۰۰۰۱۰۰۰۰۰۰۰۰۰۰۰' ruxeeltzij = (Marksim5(نمونہ=kutbäl), Marksim5_yal(نمونہ=kutbäl), NASA()) tzij = nukolibäl.کوائف_پانا(سے='20500101', تک='20600101', ذرائع=ruxeeltzij)
