Repository: julienmalard/Marksim
Catalog: دستاویزات/source/_locale/cak/LC_MESSAGES/nmune/mshahdat.po
Languages: cak

source: مشاہدات کی تياری
cak: Ruchojmisaxïk tz'etelil

source: اگر آپکے پاس آب وہوا کے مشاہدات ہیں، تقدیر ان سے کوائف لينے کی کوشش کریگا۔کوائف نہ ملنے کی صورت میں دوسرے ذرائع سے کوائف لےگا۔ آپ کے کوائف جیسن، سی اس وی یا ڈیسيٹ کے مطابق (``.WTH``) ہو سکتے ہیں۔
cak: We k'o tz'etelil richin ruwäch q'ij awik'in, Taqdir xtikusaj re tzij la' nab'ey. K'a ri xtikanoj pa jun chïk ruxe'el tzij xaxe ri tzij man xril ta' chïk chupam atz'etelil. Konojel wuj csv, json, chuqa DSSAT (``.WTH``) kib'eyal yetikïr ye'ok ruxe'el atzij richin tz'etelil.

source: from تقدیر.ذرائع import سی_اس_وی, ڈیسيٹ, جیسن from تقدیر.مقام import مقام جگہ = dict(عرض=11.02, طول=76.96, بلندی=1) مشاہدات۱ = سی_اس_وی('مشاہدات.csv', **جگہ) مشاہدات۲ = جیسن('مشاہدات.json', **جگہ) مشاہدات۳ = ڈیسيٹ('ACNM1301.WTH') م = مقام(**جگہ) م.کوائف_پانا(سے='۲۰۰۰۰۱۰۱', تک='۲۰۱۷۰۱۰۱', ذرائع=[مشاہدات۱, مشاہدات۲, مشاہدات۳], خاکے='۲۔۶')
cak: from تقدیر.ذرائع import سی_اس_وی as Csv, جیسن as Json, ڈیسيٹ as Dssat from تقدیر.مقام import مقام as Kolibäl nu_kolibäl = dict(عرض=11.02, طول=76.96, بلندی=1) tzetelil_1 = Csv("tz'etelil.csv", **nu_kolibäl) tzetelil_2 = Json("tz'etelil.json", **nu_kolibäl) tzetelil_3 = Dssat('ACNM1301.WTH') ko = Kolibäl(**nu_kolibäl) ko.کوائف_پانا(سے='20000101', تک='20170101', ذرائع=[tzetelil_1, tzetelil_2, tzetelil_3], خاکے='2.6')

source: کوائف ڈھونڈنے کی ترتیب کچھ اس طرح سے ہوگی۔ سب سے پہلے مطلوبہ جگہ پر لیے گئے اعدادوشمار، اس کے بعد ناساکے اعدادوشمار اور سب سے آخر میں مرکسم کے اعدادوشمار۔ اگر آپ نہیں چاہتے کہ نامعلوم کوائف دوسرے ذرائع سے ڈھونڈیں تو ذرائع توپل میں دینا:
cak: We k'o tz'etelil, Taqdir nab'ey xtukanoj ri tzij chupam ruxe'el tzij richin tz'etelil. K'a ri' xtukanoj chupam ruxe'el tzij richin NASA k'a ri' chupam ruxe'el tzij richin Marksim. We man nawajo ta chi Taqdir nukanoj ri mena'on taq tzij pa jun chïk ruxe'el tzij, taya' ri taq kib'i' chupam jun tuple:

source: م = مقام(**جگہ) م.کوائف_پانا(سے='۲۰۰۰۰۱۰۱', تک='۲۰۱۷۰۱۰۱', ذرائع=(مشاہدات۱, مشاہدات۲, مشاہدات۳))
cak: ko = Kolibäl(**nu_kolibäl) ko.کوائف_پانا(سے='20000101', تک='20170101', ذرائع=(tzetelil_1, tzetelil_2, tzetelil_3))

source: اب، نامعلوم کوائف کے جگہ میں ``np.nan`` ھی ہوگا۔
cak: Wakamin k'o ``np.nan`` pa ri kik'olib'äl ri mena'on taq tzij.

source: اگر آپکے جیسن اور سی اس وی کےعمودی ستونوں کے نام :ref:`تقدیر کے متغیّرات کے نام <متغیّرات>` سے مختلف ہیں، تو کوئی مسئلہ نہیں ہے ۔
cak: We kib'i' ruche'el pa awuj csv chuqa' json man e junan ta kik'in :ref:`kib'i' taq retal jaloj kichin Taqdir <متغیّرات>`, majun k'ayew ta.

source: میرے_متغیّر_کا_نام = {'بارش': 'மழை'} سی_اس_وی('مشاہدات.csv', **جگہ, تبديل_ستون=میرے_متغیّر_کا_نام)
cak: rubi_retal_nujaloj = {'بارش': "jab'"} Csv("Tz'etelil.csv", **جگہ, تبديل_ستون=rubi_retal_nujaloj)

source: ماہانہ اور سالانہ کے مشاہدات
cak: Tz'etelil richin ik' chuqa' richin junab'

source: اگر آپکے مشاھدات ماہانہ یا سالانہ کی طرز پر ہیں،اور آپ کو روزانہ کی طرز پر کوائف چاہیں تو تقدیر آپکے لئے انسے روزانہ کی طرز پر کوائف بناے گا۔ تقدیر ڈیسيٹ کے ماہانہ کوائف کی مسل (``.MTH``) کو بھی پڑھ لیتا ہے۔
cak: Taqdir nitikïr nkwaj tz'etelil richin ik' chuqa' richin junab' k'a ri' yerujal pa tzij richin q'ij. Taqdir nitikïr chuqa' nusik'ij rub'eyal wuj ruxe'el tzij richin ik' richin DSSAT (``.MTH``).

source: مشاہدات۱ = جیسن('ماہانہ.json', **جگہ) مشاہدات۲ = ڈیسيٹ('ARPE.MTH') م = مقام(**جگہ) م.کوائف_پانا(سے='۲۰۰۰۰۱۰۱', تک='۲۰۱۷۰۱۰۱', ذرائع=[مشاہدات۱, مشاہدات۲])
cak: tzetelil_1 = Json("ik'.json", **nu_kolibäl) tzetelil_2 = Dssat('ARPE.MTH') ko = Kolibäl(**nu_kolibäl) ko.کوائف_پانا(سے='20000101', تک='20170101', ذرائع=[tzetelil_1, tzetelil_2])

source: خاکے کے مشاہدات
cak: Tzetelil richin chojmil

source: عام طور پر، مشاہدات ماضی کے ھوتے ہیں۔ پر اگر آپکے پاس مستقبل کے کوائف ہیں، تو خاکے کے طور پر بھی مشاھدات بنا سکتے ہیں۔ اس طرخ کے مشاھدات اہم ہو سکتے ہیں جب آپکے پاس مطلوبہ جگہ کی آب وہواکی تبدیلی کے نمونے کے نتائج ہوں۔
cak: K'iy b'i'aj, ri tzetelil xaxe' richin ri q'ijul kan. Po we k'o atzetelil tzij richin ri q'ijul apon, yattikïr naya' jun kichojmil chuqa'. Re la' nik'atzin toq k'o ruk'isb'äl jun k'utb'äl richin rujaloj ruwäch q'ij richin jun perulew awik'in.

source: from تقدیر.ذرائع import سی_اس_وی from تقدیر.مقام import مقام جگہ = dict(عرض=11.02, طول=76.96, بلندی=1) مشاہدات_۲۶ = سی_اس_وی('مشاہدات.csv', **جگہ, خاکے='۲۔۶') مشاہدات_۸۵ = سی_اس_وی('مشاہدات.csv', **جگہ, خاکے='۸۔۵') م = مقام(**جگہ) # مشاہدات_۲۶ کے کوائف ھی ملیں گے۔ م.کوائف_پانا(سے='۲۰۱۸۰۱۰۱', تک='۲۰۱۷۰۱۰۱', ذرائع=[مشاہدات_۲۶, مشاہدات_۸۵], خاکے='۲۔۶') # مشاہدات_۸۵ کے کوائف ھی ملیں گے۔ م.کوائف_پانا(سے='۲۰۱۸۰۱۰۱', تک='۲۰۱۷۰۱۰۱', ذرائع=[مشاہدات_۲۶, مشاہدات_۸۵], خاکے='۸۔۵')
cak: from تقدیر.ذرائع import سی_اس_وی as Csv from تقدیر.مقام import مقام as Kolibäl nu_kolibäl = dict(عرض=11.02, طول=76.96, بلندی=1) Tzetelil_26 = Csv("Tz'etelil_26.csv", **nu_kolibäl, خاکے='2.6') Tzetelil_85 = Csv("Tz'etelil_85.csv", **nu_kolibäl, خاکے='8.5') ko = Kolibäl(**nu_kolibäl) # Xaxe xtiya' ri taq tzij richin Tzetelil_26 ko.کوائف_پانا(سے='20180101', تک='20170101', ذرائع=[Tzetelil_26, Tzetelil_85], خاکے='2.6') # Xaxe xtiya' ri taq tzij richin Tzetelil_85 ko.کوائف_پانا(سے='20180101', تک='20170101', ذرائع=[Tzetelil_26, Tzetelil_85], خاکے='8.5')
