Repository: julienmalard/Marksim
Catalog: دستاویزات/source/_locale/cak/LC_MESSAGES/index.po
Languages: cak

source: تعارف
cak: Tzijol

source: ترقی
cak: Ruk'iyirisaxïk

source: برنامج کاری مواجہ
cak: Tunüy rokisanel cholkema'

source: تقدیر کی دستاویزات پر خوش آمدید!
cak: ¡Ütz apetïk pa ruwuj Taqdir!

source: تقدیر کیا ہے؟
cak: ¿Achike ri Taqdir?

source: تقدیر آب وہوا میں تبدیلی کے کوائف پایتھون کو دیتا ہے۔
cak: Taqdir nik'am pa Python ri tzij richin jalajöj ruwäch q'ij.

source: اسکا نام تقدیر کیوں ہے؟
cak: ¿Achike rub'eyal Taqdir rub'i'?

source: ہم نے اسے تقد ير کا نام ديا ہے کيو نکہ ہم سمجتھے ہيں کہ آب و ہوا کی تبد يلی ميں تقد ير کو ئی نہيں ہے، سوا ئے انسانيت کی بے و قوفی کے۔
cak: Xqaya' rub'i' Taqdir ("Ch'umilal" pa Urdu ch'ab'äl) chi majun b'i'aj ta tiqamestaj chi majun ch'umilal ta chupam ri jaloj ruwäch q'ij, xaxe ri mena'oj röj winaqi'.

source: مجھے تقدیر کی کیوں ضرورت ہوگی؟
cak: ¿Achike roma xtinwajo' ninkusaj Taqdir?

source: کیا آپکو آب وہواکی تبدیلیوں کے کوائف درکار ہیں، ليکن نہيں جانتے کہ يہ کوائف کہاں سے ملیں گے؟
cak: ¿La k'o awajwaxïk koma ruxe'el tzij richin jalajöj ruwäch q'ij, po man awetaman ta akuchi' yattikïr ye'akanoj?

source: یا کیا آپکے پاس کوائف ہیں، ليکن ۱۰ مختلف جگہوں اور مختلف اوقات میں ہيں؟
cak: ¿La k'o chïk aruxe'el tzij, po pa 10 yakb'äl man junan ta, pa k'iy wuj man junan ta kib'eyal?

source: شاید مرکسم کا استعمال کرناچاہتے ہیں، ليکن دستی طريقے سے مرکسم کے۲۰۰ مسل کے نتائج پڑھناممکن نہیں لگ رہا؟
cak: ¿La k'o awajwaxïk roma rukusaxïk Marksim, po man yatkiköt ta chi nachojmisaj 100 yakb'äl kichin raponil Marksim pa yon?

source: تقدیران تينوں معاملات میں سب آسانی مہيا کرتا ہے۔
cak: Taqdir yatruto' kik'in konojel la'.

source: آپکے پاس کوائف نہیں ہیں؟ تقدیر انہیں آپکے لئے ڈھونڈ پايگا، چاھے کوائف ماضی، حال يا مستقبل کے ہوں۔
cak: ¿Majun ta ruxe'el atzij? Majun k'ayew, Taqdir xkerukanoj awoma, kichin q'ijul kan, wakamin chuqa' apon.

source: آپکے پاس مختلف جگہوں اور مختلف اوقات میں کوائف ہیں؟ تقدیر انہیں پہلےمرحلے ميں جوڑدیگا اور دوسرے مرحلے میں نامعلوم دنوں کے کوائف آپکے لئے ڈھونڈیگا۔
cak: ¿La k'iy kochochib'äl, k'iy kiwäch ruxe'el atzij? Taqdir xkerujunumaj, k'a ri' xtikanoj ri mena'on taq tzij awoma.

source: آپکے پاس ماہانہ کوائف ہیں، ليکن آپکو روزانہ کی بنياد پر کوائف درکار ہيں؟ یا روزانہ ہیں پر ماہانہ چاہئيں؟ تقد ير اس سلسلے ميں بھی مددگار ہے۔
cak: ¿La k'o ruxe'el atzij richin ruwäch q'ij, po richin ik' toq nik'atzin chawe richin q'ij? ¿La k'o richin q'ij toq nik'atzin richin ik'? Taqdir xkeruchojmisaj awoma.

source: اشاریہ
cak: Cholwuj

source: اشاریہ اور جدول
cak: Cholwuj chuqa' kik'ajtz'ïk

source: :ref:`اشاریہ <genindex>`
cak: :ref:`Cholwuj <genindex>`

source: :ref:`کھوج <search>`
cak: :ref:`Rukanoxïk<search>`
