Repository: julienmalard/Marksim
Catalog: دستاویزات/source/_locale/cak/LC_MESSAGES/malumat.po
Languages: cak

source: معلومات
cak: Etamab'äl

source: ذرائع
cak: Ruxe'el tzij

source: تقدیر کے بنیادی ذرائع نیچے دیے گيے ہیں۔
cak: Wawe k'o wi ri taq ruxe'el tzij richin Taqdir.

source: تقدیر کے بنیادی ذرائع
cak: Ruxe'el tzij richin Taqdir

source: ذریعہ
cak: Ruxe'el tzij

source: آب وہوا تبدیلی کے خاکے
cak: Chojmil richin jaloj ruwäch q'ij

source: دستیاب سال
cak: Junab'

source: ماضی
cak: Q'ijul kan

source: ~۱۹۸۳ - آج
cak: ~1983-wakamin

source: ۲۰۹۵ تک
cak: Pa 2095

source: اول الذکر ذرائع ماضی اور مستقبل کے لئے مفید ہیں۔ اگر آپ اپنے مشاہدات کے ساتھ کام کرنا چاہتے ہیں تو درجہ ذيل ذرائع کارآمد ہوسکتے ہیں يہ ذرائع مسل سے کوائف پڑھتے ہیں۔
cak: Ri ruxe'el tzij pa jotöl yek'atzin roma rukanoxïk tzij richin q'ijul kan chuqa' q'ijul apon. We nawajo nasamaj rik'in tzij richin tz'etelil ri taq ruxe'el tzij e k'o chuxe' yek'atzin chawe chi nasik'ij tzij e k'o chupam jun wuj.

source: متغیّرات
cak: Retal jaloj

source: تقدیر میں يہ متغیّرات دستیاب ہیں۔
cak: K'o ri taq retal jaloj re' pa Taqdir.

source: احتیاط کریں ہو سکتا ہے کہ سارے ذرائع میں سارے متغیّرات دستیاب نہ ہوں۔
cak: Man konojel ta ri ruxe'el tzij k'o konojel ri taq retal jaloj chupam.

source: نام
cak: Rub'i'

source: معنی
cak: Q'ajatzij

source: وحدت
cak: Junilal

source: تاریخ
cak: Q'ij

source: روزانہ (``۲۰۱۸۰۱۰۱``)، ماہانہ (``۲۰۱۸۰۱``)، یا سالانہ (``۲۰۱۸``)
cak: Q'ij (``20180101``), ik', (``201801``), chuqa' junab' (``2018``)

source: بارش
cak: Jab'

source: ملیمیٹر
cak: Puyaj

source: شمسی تابکاری
cak: Ilob'anem ruch'ab' q'ij

source: درجہ حرارت زیادہ سے زیادہ
cak: Nimalaxel tewk'atanil

source: سیلسیس
cak: C

source: درجہ حرارت کم سے کم
cak: Ch'uti' tewk'atanil

source: درجہ حرارت کا اوسط
cak: Lomanil tewk'atanil
