Repository: julienmalard/Marksim
Catalog: دستاویزات/source/_locale/cak/LC_MESSAGES/shuruat.po
Languages: cak

source: ابتدايئہ
cak: Rutikirib'äl

source: تنصیب
cak: Nimonem

source: تقدیر کی تنصیب کرنا بہت اسان ہے۔
cak: Chanim yatkowin nanimoj ri Taqdir.

source: تازہ ترين تقدیر گٹھب پر دستياب ہے۔ اسے موصول کرنے کے ليے لکھيں:
cak: We nawajo nanimoj ri ruk'ak'a jalwäch Taqdir pa Github, tatz'ib'aj:

source: تقدیر کیسے کام کرتا ہے؟
cak: ¿Achike rub'eyal nisamaj ri Taqdir?

source: اگر آپکے پاس مشاہدات ہیں تو کوائف ڈھونڈنے کی ترتیب کچھ اس طرح سے ہوگی۔ سب سے پہلے مطلوبہ جگہ پر لیے گئےآپکے اعدادوشمار، اس کے بعد ناساکے اعدادوشمار (ماضی کے لئے)اور سب سے آخر میں مرکسم کے اعدادوشمار(مستقبل کے لئے)۔
cak: We k'o tz'etelil, Taqdir nab'ey xtukanoj ri tzij chupam ruxe'el tzij richin tz'etelil. K'a ri' xtukanoj chupam ruxe'el tzij richin NASA (roma ri q'ijul kan) k'a ri' chupam ruxe'el tzij richin Marksim (roma ri q'ijul apon).

source: استعمال کرنے کا طريقہ؟
cak: ¿Achike rub'eyal ninkusaj ri Taqdir?

source: پہلے ایک مقام بنانيں۔ يہ مطلوبہ جگہ کو ظاہر کرے گا جسکے ہمہیں کوائف چاییئں۔اس کے بعد مدت مت‏عيں کريں۔ تقدیر سے اسّے کوائف مل جائيں گے۔
cak: Nab'ey k'o chi nab'an jun k'olib'äl, akuchi nawajo nakanoj rutzij ruwäch q'ij. K'a ri' tab'ij chire achike ri peraj ramaj achojoma nawajo tzij. Xaxe' la', k'a ri Taqdir xtukanoj ri tzij awoma.

source: from تقدیر.مقام import مقام میرا_مقام = مقام(‏عرض=11.02, طول=76.96, بلندی=1) کو = میرا_مقام.کوائف_پانا(سے='۲۰۱۷۰۱۰۱', تک='۲۰۱۸۰۱۰۱') کو.لاپتہ() # نامعلوم دنوں کے نام پانا کو.روزانہ() # روزانہ کوائف، پاندس میں # ماہانہ اور سالانہ کوائف کے ليے کو.ماہانہ() کو.سالانہ() # نتیجے کو مسل کے طور پر بھی لکھ سکتے ہیں۔ کو.لکھنا('/میرا/راستہ', '.csv')
cak: from تقدیر.مقام import مقام as kolibäl nukolibäl = kolibäl(‏عرض=11.02, طول=76.96, بلندی=1) tzij = nukolibäl.کوائف_پانا(سے='20170101', تک='20180101') tzij.لاپتہ() # Ri taq q'ij majun kitzij tzij.روزانہ() # Tzij richin q'ij, pa Pandas # We nawajo tzij richin ik' chuqa' junab' tzij.ماہانہ() tzij.سالانہ() # Chi nayak ri k'isib'äl pa jun wuj tzij.لکھنا("/jun/rochochib'äl", '.csv')

source: اگر آپکے پاس مشاہدات کے کوائف ہیں تو یہ بھی جوڑے جا سکتے ہیں۔
cak: We k'o atzij richin tz'etelil yattikïr najunumaja' chuqa'.

source: from تقدیر.مقام import مقام from تقدیر.ذرائع import سی_اس_وی میرا_مقام = مقام(‏عرض=11.02, طول=76.96, بلندی=1) مشاہدات = سی_اس_وی('مشاہدات.csv', عرض=11.02, طول=76.96, بلندی=1) کو = میرا_مقام.کوائف_پانا(سے='۲۰۱۸۰۱۰۱', تک='۲۰۱۷۰۱۰۱', ذرائع=مشاہدات)
cak: from تقدیر.مقام import مقام as Kolibäl from تقدیر.ذرائع import سی_اس_وی as Csv nukolibäl = Kolibäl(‏عرض=11.02, طول=76.96, بلندی=1) tzetelil = Csv("Tz'etelil.csv", عرض=11.02, طول=76.96, بلندی=1) tzij = nukolibäl.کوائف_پانا(سے='20180101', تک='20170101', ذرائع=tzetelil)

source: مشاہدات کو ڈیسيٹ اور جےسن سے بھی پڑھا جا سکتا ہے۔
cak: Taqdir nitikïr chuqa' nusik'ij tzij chupam wuj richin DSSAT chuqa' richin json.
