Repository: julienmalard/Marksim
Catalog: دستاویزات/source/_locale/*/LC_MESSAGES/moajh/koaef.po
Languages: fr, hi

source: کوائف
fr: Données
hi: आँकड़े

source: تقدیر کے سارے نتائيج :class:`~تقدیر.کوائف.کوائف` کی قسم میں مل جاتے ہیں۔
fr: Tous les résultats de taqdir sont retournées sous forme d'un objet de la classe :class:`~تقدیر.کوائف.کوائف`.
hi: तकदीर के सारे परिनामें :class:`~تقدیر.کوائف.کوائف` का वर्ग में मिल जाते हैं।

source: آب وہوا کے کوائف۔
fr: Données climatiques.
hi: जलवायु के आँकड़े।

source: روزانہ کی ظرز پر کوائف ۔
fr: Données quotidiennes.
hi: रोज़ाना के रूप में आँकड़े।

source: Returns
hi: वापस

source: Return type
hi: वापस वर्ग

source: سالانہ کی ظرز پر کوائف ۔
fr: Données annuelles.
hi: सालाना के रूप में आँकड़े।

source: کوائف کی سالانہ اوسط۔
fr: La moyenne annuelle des données.
hi: आँकड़े के सालाना औसत.

source: نا معلوم دنوں کے کوائف واپس دیگا۔
fr: Obtenir les jours avec des données manquantes.
hi: अज्ञात दिन के आँकड़े वापस देना।

source: Parameters
hi: परिवर्तनशील

source: صرف ان دنوں کے کوائف دے گا جینکے سارےعمودی ستون کے کوائف نا معلوم ہیں۔
fr: Si nous voulons uniquement les jours pour lesquels aucune variable n'a des données.
hi: सिर्फ़ उन दिनों के आँकड़ों देगा जिनके सारे स्तंभ के आँकड़े अज्ञात हैं।

source: کوائف کو مسل میں رکھنا۔
fr: Sauvegarder les données en tant que fichier.
hi: आँकड़ों को संचिका में रखना।

source: مسل کا راستہ۔
fr: Le dossier du fichier.
hi: संचिका का रास्ता।

source: مسل کا نام۔
fr: Le nom du fichier.
hi: संचिका का नाम।

source: مسل کا وضع۔ `.csv` یا `.json` ہو سکتا ہے۔
fr: Format du fichier. Doit être l'un de `.csv` ou `.json`.
hi: संचिका का रूप। `.csv` या `.json` हो सकता है।

source: ماہانہ کی ظرز پر کوائف ۔
fr: Données mensuelles.
hi: माहाना के रूप में आँकड़े।

source: کوائف کی ماہانہ اوسط۔
fr: La moyenne mensuelle des données.
hi: आँकड़ों का माहाना औस्त।
