Repository: julienmalard/Marksim
Catalog: دستاویزات/source/_locale/*/LC_MESSAGES/moajh/mqam.po
Languages: hi

source: مقام
hi: जगह

source: ایک مقام، جس کے ليے آب وہوا کے کوائف درکار ہيں۔
hi: एक जगह, जिस के लिये जलवायु के आँकड़ों पाने चाहते हैं।

source: آبوہوا کے کوائف ليناا۔
hi: जलवायु के आँकड़ों पाना।

source: Parameters
hi: परिवर्तनशील

source: وہ تاریخ جب سے کوائف چاہيں۔
hi: वह तारीख़ जब से आँकड़े चाहिये।

source: وہ تاریخ جب تک کوائف چاہيں۔
hi: वह तारीख़ जब तक आँकड़े चाहिये।

source: وہ ذرائع جن سے کوائف لينےا ہيں۔ یا :class:`~تقدیر.ذریعہ.ذریعہ`، یا انکی فہرست ہو سکتی ہے۔
hi: वह स्रोतों जिन से आँकड़ों लेना है। या :class:`~تقدیر.ذریعہ.ذریعہ`, या उनके सूची हो सकता है।

source: آب وہوا کی تبدیلی کے خاکے۔مثال کے طور پر ۸۔۵
hi: जलवायु परिवर्तन का परिदृश्य। नमूना के तौर पर ``८.५``।

source: Returns
hi: वापस

source: آب وہوا کے :class:`~تقدیر.کوائف.کوائف`۔
hi: जलवायु परिवर्तने के आँकड़े (:class:`~تقدیر.کوائف.کوائف`)।

source: Return type
hi: वापस वर्ग
