Repository: julienmalard/Marksim
Catalog: دستاویزات/source/_locale/*/LC_MESSAGES/moajh/zriya.po
Languages: fr, hi

source: ذریعہ
fr: Sources
hi: स्रोत

source: تقدیر میں مختلف قسم کے ذرائع ہیں۔ چاہئں تو آپ خود اپنے ذرائع بھی:ref:`بنا <نئے_ذرائع>` سکتے ہیں۔ تقدیر میں ۲ قسم کے ذرائع ہیں: نکتہ کے ذرائع، جو ایک مقام کے کوائف ھی فراہم کرتے ہیں، اور عام ذرائع، جو ایک رقبے یا پوری دنیا کے کوائف فراہم کرتے ہیں۔
fr: Taqdir inclut plusieurs sortes de sources de données. Si vous voulez, vous pouvez même :ref:`développer <نئے_ذرائع>`votre propre source vous-même. Il y a 2 classes générales de sources dans Taqdir : les sources ponctuelles, qui ne contiennent que les données d'un endroit a la fois, et les sources générales, qui peuvent contenir des données de plusieurs endroits, voir toute la planète.
hi: तकदीर में विभिन्न प्रकार के स्रोत हैं। चाहिये तो आप ख़ुद अपना स्रोत :ref:`बना <نئے_ذرائع>` सकते हैं। तकदीर में २ प्रकार के स्रोत हैं, बिंदु के स्रोत, जो एक जगह के आँकड़ों ही प्रदान करते हैं, और सामान्य स्रोत, जो एक क्षेत्र या पूरी दुनिया के आँकड़ों प्रदान करते हैं।

source: ان دونوں کی بنیادی ملومات نیچے دی گئی ہیں۔
fr: La documentation pour les deux classes est donnée ci-dessous.
hi: इन दोनों के मूल जानकारी नीचे दी गई हैं।

source: آب و ہوا کے کوائف کا ذریعہ۔
fr: Les sources pour les données climatiques.
hi: जलवायु के आँकड़ों का स्रोत।

source: ایک جگہ کے لئے خاکے کے لحاص سے ``سے`` سے ``تک`` تک کوائف دینا۔
fr: Obtenir les données de ``سے`` à ``تک`` pour un endroit.
hi: एक जगह के लिये परिदृश्य के अनुसार ``سے`` से ``تک`` तक आँकड़ों देना।

source: Parameters
hi: परिवर्तनशील

source: وہ تاریخ جب سے کوائف چاہيں۔
fr: La date à partir de laquelle vous voulez des données.
hi: वह तारीख़ जब से आँकड़े चाहिये।

source: وہ تاریخ جب تک کوائف چاہيں۔
fr: La date jusqu'à laquelle vous voulez de données.
hi: वह तारीख़ जब तक आँकड़े चाहिये।

source: جگہ کا عرض۔
fr: La latitude.
hi: जगह का अक्षाँश।

source: جگہ کا طول۔
fr: La longitude.
hi: जगह का देशाँतर।

source: جگہ کی بلندی۔
fr: L'élévation de l'endroit.
hi: जगह का वृद्धि।

source: آب وہوا کی تبدیلی کا خاکا۔
fr: Le scénario de changements climatiques.
hi: जलवायु परिवर्तन के परिदृश्य।

source: Returns
hi: वापस

source: کوائف، پاندس میں۔ اگر ان تاریخ، جگہ، یا خاکے کے لئے اس ذریعے میں کوائف دستیاب نہیں ہیں، تو پھر ``None`` واپس دینا۔ پاندس کا اشاریہ pd.PeriodIndex ہونا چاہئے۔ اشاریہ روزانہ، ماہانہ، سا لانہ کا ہو سکتا ہے۔
fr: Les données, en format Pandas. Si il n'y a pas de données de disponibles pour les dates désirées à l'endroit et avec le scénario spécifiés, ``None`` sera retourné. L'index des données retournées devrait être un index de la classe ``pd.PeriodIndex``. L'index peut être d'une fréquence quotidienne, mensuelle ou annuelle.
hi: आँकड़े पांडस में। अगर इन तारीख़, जगह, या परिदृश्य के लिये इस स्रोत में आँकड़े उपलब्ध नहीं हैं, तो फ़िर ``None`` वापस देना। पांडस का सूचकांक pd.PeriodIndex होना चाहिये। सूचकांक रोज़ाना, माहाना या सालाना का हो सकता है।

source: Return type
hi: वापस वर्ग

source: وہ کوائف مہيا کرنا جو ``سے`` اور ``تک`` تاریخ کے درميان اس جگہ اور خاکے کے ليے دستیاب ہیں۔
fr: Obtenir les données disponibles entre les jours ``سے`` et ``تک`` pour l'endroit et le scénario spécifiés.
hi: उन आँकड़ों वापस देना जो ``سے`` और ``تک`` तारीख़ के बीच में इस जगह और परिदृश्य के लिये उपलब्ध हैं।

source: وہ تاریخ جب تک کوائف چاہيں ۔
fr: La date jusqu'à laquelle vous voulez de données.
hi: वह तारीख़ जब तक आँकड़े चाहिये।

source: جگہ کی عرض۔
fr: La latitude.
hi: जगह का अक्षाँश।

source: جگہ کی طول۔
fr: La longitude de l'endroit.
hi: जगह का देशाँतर।

source: ہمہارے (روزانہ) کوائف۔
fr: Nos données quotidiennes.
hi: हम्हारे (रोज़ाने) आँकड़े।

source: نکتہ کے ذرائع اعم ذرائع کے جیسے ہیں، پر انہیں بناتے پر ھی بتانے پڈتا ہیے کہ کیس جگہ کے ہیں۔
fr: Les sources ponctuelles sont similaires aux sources régulières, mais leur endroit doit être spécifié au moment qu'elles sont initialisées.
hi: बिंदु के स्रोत सामान्य स्रोत के जैसे हैं, पर उन्हें बनाते पर ही बताने पड़ता है के कीस जगह के हैं।

source: کوائف:
fr: Données
