Repository: julienmalard/Marksim
Catalog: دستاویزات/source/_locale/cak/LC_MESSAGES/moajh/koaef.po
Languages: cak

source: کوائف
cak: Tzij

source: تقدیر کے سارے نتائيج :class:`~تقدیر.کوائف.کوائف` کی قسم میں مل جاتے ہیں۔
cak: Konojel ruk'isib'äl richin Taqdir yeb'epon achi'el jun wachinäq :class:`~تقدیر.کوائف.کوائف` ruwäch.

source: آب وہوا کے کوائف۔
cak: Ruxe'el kitzij ri taq jalajöj ruwäch q'ij.

source: روزانہ کی ظرز پر کوائف ۔
cak: Tzij richin q'ij.

source: سالانہ کی ظرز پر کوائف ۔
cak: Tzij richin junab'.

source: کوائف کی سالانہ اوسط۔
cak: Runik'ajal junab' kichin tzij.

source: نا معلوم دنوں کے کوائف واپس دیگا۔
cak: Nuya' ri taq q'ij mena'on kitzij.

source: صرف ان دنوں کے کوائف دے گا جینکے سارےعمودی ستون کے کوائف نا معلوم ہیں۔
cak: Chi nuya xaxe ri taq q'ij majun ta kitzij pa konojel taq ruche'el retal jaloj.

source: کوائف کو مسل میں رکھنا۔
cak: Nuyak ri tzij chupam jun wuj.

source: مسل کا راستہ۔
cak: Rochochib'äj wuj.

source: مسل کا نام۔
cak: Rub'i' wuj.

source: مسل کا وضع۔ `.csv` یا `.json` ہو سکتا ہے۔
cak: Rub'eyal wuj. Yattikïr naya' `.csv` chuqa' `.json`.

source: ماہانہ کی ظرز پر کوائف ۔
cak: Nuya' tzij richin ik'.

source: کوائف کی ماہانہ اوسط۔
cak: Runik'ajal ik' richin tzij.
