Repository: julienmalard/Marksim
Catalog: دستاویزات/source/_locale/cak/LC_MESSAGES/moajh/zriya.po
Languages: cak

source: ذریعہ
cak: Ruxe'el tzij

source: تقدیر میں مختلف قسم کے ذرائع ہیں۔ چاہئں تو آپ خود اپنے ذرائع بھی:ref:`بنا <نئے_ذرائع>` سکتے ہیں۔ تقدیر میں ۲ قسم کے ذرائع ہیں: نکتہ کے ذرائع، جو ایک مقام کے کوائف ھی فراہم کرتے ہیں، اور عام ذرائع، جو ایک رقبے یا پوری دنیا کے کوائف فراہم کرتے ہیں۔
cak: E k'iy kiwäch ri taq ruxe'el tzij richin Taqdir. We nawajo, yattikïr :ref:`nab'an <نئے_ذرائع>` jun ak'ak'a ruxe'el tzij. E ka'i' kiwäch ruxe'el tzij yattikïr nab'an chupam Taqdir: chuq' ruxe'el tzij, achojupam xaxe nukanaj ri tzij richin jun k'olib'äl, chuqa' choj ruxe'el tzij. achojupam yekanaj tzij kichin k'iy taq k'olib'äl.

source: ان دونوں کی بنیادی ملومات نیچے دی گئی ہیں۔
cak: Ketamab'äl ri ka'i' e k'o wawe chuxe'.

source: آب و ہوا کے کوائف کا ذریعہ۔
cak: Ruxe'el rutzij ruwäch q'ij.

source: ایک جگہ کے لئے خاکے کے لحاص سے ``سے`` سے ``تک`` تک کوائف دینا۔
cak: Nuya' tzij richin jaloj ruwäch q'ij roma jun k'olib'äl chuqa' chojmil (nab'ey qij: ``سے``, k'isb'äl q'ij: ``تک`` ).

source: وہ تاریخ جب سے کوائف چاہيں۔
cak: Ri nab'ey q'ij achojoma nawajo tzij.

source: وہ تاریخ جب تک کوائف چاہيں۔
cak: Ri k'isb'äl q'ij achojoma nawajo tzij.

source: جگہ کا عرض۔
cak: Rukojob'alil ri k'olib'äl.

source: جگہ کا طول۔
cak: Raqän ri k'olib'äl.

source: جگہ کی بلندی۔
cak: Rupa'alem ri k'olib'äl.

source: آب وہوا کی تبدیلی کا خاکا۔
cak: Ruchojmil jaloj ruwäch q'ij.

source: کوائف، پاندس میں۔ اگر ان تاریخ، جگہ، یا خاکے کے لئے اس ذریعے میں کوائف دستیاب نہیں ہیں، تو پھر ``None`` واپس دینا۔ پاندس کا اشاریہ pd.PeriodIndex ہونا چاہئے۔ اشاریہ روزانہ، ماہانہ، سا لانہ کا ہو سکتا ہے۔
cak: Ri tzij, pa rub'eyal Pandas. We man xatikïr nawil tzij richin ri k'olib'äl chuqa' ri chojmil xawajo' chupam ri ruxe'el tzij re, xaxe taya' ``None``. Rajwaxïk chi ``pd.PeriodIndex`` (ütz' richin q'ij, ik' chuqa' junab') rub'eyal ri cholwuj richin Pandas.

source: وہ کوائف مہيا کرنا جو ``سے`` اور ``تک`` تاریخ کے درميان اس جگہ اور خاکے کے ليے دستیاب ہیں۔
cak: Nuya' ruxe'el tzij richin ri k'olib'äl chuqa' ri chojmil xawajo (nab'ey q'ij: ``سے``, k'isb'äl q'ij: ``تک``).

source: وہ تاریخ جب تک کوائف چاہيں ۔
cak: Ri k'isb'äl q'ij achojoma nawajo tzij.

source: جگہ کی عرض۔
cak: Ruk'ojob'alil ri k'olib'äl.

source: جگہ کی طول۔
cak: Raqan ri k'olib'äl.

source: کوائف:
cak: Tzij:

source: ہمہارے (روزانہ) کوائف۔
cak: Qatzij, richin q'ij.

source: نکتہ کے ذرائع اعم ذرائع کے جیسے ہیں، پر انہیں بناتے پر ھی بتانے پڈتا ہیے کہ کیس جگہ کے ہیں۔
cak: Ri chuq' ruxe'el tzij xa junan rik'in ri choj ruxe'el tzij, po toq nab'an jun ruwachinäq k'o chi nab'ij chire akuchi k'o wi' chuqa' achike ruchojmil.
