Repository: julienmalard/Marksim
Catalog: دستاویزات/source/_locale/*/LC_MESSAGES/ibtadai.po
Languages: hi

source: ابتدايئہ
hi: शुरुआत

source: تنصیب
hi: स्थापना

source: تقدیر کی تنصیب کرنا بہت اسان ہے۔
hi: तकदीर का स्थापना करना बहुत असान है।

source: تازہ ترين تقدیر گٹھب پر دستياب ہے۔ اسے موصول کرنے کے ليے لکھيں:
hi: नवीनतम तकदीर किटहब से उपलब्ध है। उसे प्राप्त करने कि लिये लिखें

source: تقدیر کیسے کام کرتا ہے؟
hi: तकदीर कैसा काम करता है।

source: اگر آپکے پاس مشاہدات ہیں تو کوائف ڈھونڈنے کی ترتیب کچھ اس طرح سے ہوگی۔ سب سے پہلے مطلوبہ جگہ پر لیے گئےآپکے اعدادوشمار، اس کے بعد ناساکے اعدادوشمار (ماضی کے لئے) اور سب سے آخر میں مرکسم کے اعدادوشمار (مستقبل کے لئے)۔
hi: अगर आपके पास प्रेक्षण हैं तो आँकड़ों ढूँढने का प्रक्रिया इस तरह से हागा। सब से पहले आवश्यक जगह पर लिये गए आपके आँकड़े, उस के बाद नासा के आँकड़े (भूत के लिये) और सब से खत्म में मर्कसिम के आँकड़े (भविश्य के लिये)।

source: استعمال کرنے کا طريقہ؟
hi: उसके प्रोयग कैसा करूँ।

source: پہلے ایک مقام بنانيں۔ يہ مطلوبہ جگہ کو ظاہر کرے گا جسکے ہمہیں کوائف چاییئں۔اس کے بعد مدت مت‏عيں کريں۔ تقدیر سے اسّے کوائف مل جائيں گے۔
hi: पहले उन निर्देशांक से एक जगह बनाना, जिन से आपको आँकड़ों की ज़रूरत है। बाद आवश्यक तारीख़ों निर्दिष्ट करना, और तकदीर आपके लिये आँकड़ों बना लेगा।

source: import matplotlib.pyplot as plt from تقدیر.ذرائع import سی_اس_وی, دیسات, جےسن from تقدیر.مقام import مقام جگہ = dict(عرض=11.02, طول=76.96, بلندی=1) م = مقام(**جگہ) کو = م.کوائف_پانا(سے='۲۰۰۰۰۱۰۱', تک='۲۰۰۱۰۱۰۱', خاکے='۲.۶') روزانہ = کو.روزانہ() روزانہ.plot(kind='line')
hi: import matplotlib.pyplot as plt from تقدیر.ذرائع import سی_اس_وی as सी_एस_वी,, دیسات as दीस्सात, جےسن as जेसान from تقدیر.مقام import مقام as जगह निर्देशांक = dict(عرض=11.02, طول=76.96, بلندی=1) मेरा_जगह = مقام(**निर्देशांक) आँ = मेरा_जगह.کوائف_پانا(سے='२००००१०१', تک='२००१०१०१', خاکے='२.६') रोज़ाना = आँ.روزانہ() रोज़ाना.plot(kind='line')

source: (`Source code <.//ibtadai-1.py>`__, `png <.//ibtadai-1.png>`__, `hires.png <.//ibtadai-1.hires.png>`__, `pdf <.//ibtadai-1.pdf>`__)
hi: (`मूल <.//ibtadai-1.py>`__, `पी एन जी <.//ibtadai-1.png>`__, `hires.png <.//ibtadai-1.hires.png>`__, `पी डी एफ़ <.//ibtadai-1.pdf>`__)

source: کو.لاپتہ() # نامعلوم دنوں کے نام پانا # ماہانہ اور سالانہ کوائف کے ليے ماہانہ = کو.ماہانہ() کو.سالانہ() ماہانہ.plot(kind='line')
hi: आँ.لاپتہ() # अज्ञात दिनों के नाम पाना # माहाना और सालाना आँकड़ों के लिये माहाना = आँ.ماہانہ() आँ.سالانہ() माहाना.plot(kind='line')

source: (`Source code <.//ibtadai-2.py>`__, `png <.//ibtadai-2.png>`__, `hires.png <.//ibtadai-2.hires.png>`__, `pdf <.//ibtadai-2.pdf>`__)
hi: (`स्रोत <.//ibtadai-2.py>`__, `पी एन जी <.//ibtadai-2.png>`__, `hires.png <.//ibtadai-2.hires.png>`__, `पी डी एफ़ <.//ibtadai-2.pdf>`__)

source: نتیجے کو مسل کے طور پر بھی لکھ سکتے ہیں۔
hi: परिणामों संचिका में भी लिख सकते हैं।

source: کو.لکھنا('/میرا/راستہ', '.csv')
hi: आँ.لکھنا('/मेरा/रास्ता', '.csv')

source: اگر آپکے پاس مشاہدات کے کوائف ہیں تو یہ بھی جوڑے جا سکتے ہیں۔
hi: और, अगर आपके पास प्रेक्षण के आँकड़े, तो यह भी जोड़े जा सकते हैं।

source: from تقدیر.مقام import مقام from تقدیر.ذرائع import سی_اس_وی میرا_مقام = مقام(‏عرض=11.02, طول=76.96, بلندی=1) مشاہدات = سی_اس_وی('مشاہدات.csv', عرض=11.02, طول=76.96, بلندی=1) کو = میرا_مقام.کوائف_پانا(سے='۲۰۱۸۰۱۰۱', تک='۲۰۱۷۰۱۰۱', ذرائع=مشاہدات)
hi: from تقدیر.مقام import مقام as जगह from تقدیر.ذرائع import سی_اس_وی as सी_एस_वी मेरा_जगह = जगह(چوڑائی=11.02, طول=76.96, بلندی=1) प्रे = सी_एस_वी('प्रेक्षण.csv', چوڑائی=11.02, طول=76.96, بلندی=1) आँकड़े = मेरा_जगह.کوائف_پانا(سے='२०१८०१०१', تک='२०१७०१०१', ذرائع=प्रे)

source: مشاہدات کو دیسات اور جےسن سے بھی پڑھا جا سکتا ہے۔
hi: प्रेक्षण तो जेसान या दीस्सात के रूप से भी पढ़े जा सकते हैँ।
