Repository: julienmalard/Marksim
Catalog: دستاویزات/source/_locale/*/LC_MESSAGES/index.po
Languages: es, fr, hi

source: تعارف
es: Información
fr: Information
hi: परिचय

source: نمونے
fr: Exemples

source: ترقی
es: Desarrollo
fr: Développement
hi: विकास

source: برنامج کاری مواجہ
es: Interfaz de programación
fr: IPA
hi: क्रमानुदेशन अंतराफलक

source: تقدیر کی دستاویزات پر خوش آمدید!
es: ¡Bienvenida a la documentación de Taqdir!
fr: Bienvenue à la documentation de Taqdir !
hi: तकदीर के प्रलेखन पर आपका स्वागत हो।

source: تقدیر کیا ہے؟
es: ¿Qué es Taqdir?
fr: Qu'est-ce que Taqdir ?
hi: तकदीर क्या है।

source: تقدیر آب وہوا میں تبدیلی کے کوائف پایتھون کو دیتا ہے۔
es: Taqdir trae los datos de cambios climáticos a Python.
fr: Taqdir apporte les données de changements climatiques à Python.
hi: तकदीर जलवायु परिवर्तन के आँकड़ों पैथान को लेता है।

source: اسکا نام تقدیر کیوں ہے؟
es: ¿Por qué se llama Taqdir?
fr: Pourquoi est-ce que ça s'appelle Taqdir ?
hi: उसका नाम क्यों तकदीर है।

source: ہم نے اسے تقد ير کا نام ديا ہے کيو نکہ ہم سمجتھے ہيں کہ آب و ہوا کی تبد يلی ميں تقد ير کو ئی نہيں ہے، سوا ئے انسانيت کی بے و قوفی کے۔
es: Se llama Taqdir ("destino" en urdu) para que nunca se nos olvide que no hay nada del destino en lo de los cambios climáticos, a parte, tal vez, la estupidez humana.
fr: Nous l'avons appelé Taqdir ("destin" en Ourdou) pour être sûr qu'on n'oublie jamais qu'il n'y a rien du destin dans les changements climatiques, sauf peut-être la stupidité humaine.
hi: हमने उसे तकदीर का नाम दिया कियोंकि हम समझते हैं कि जलवायु परिवर्तन में तक़दीर कोई नहीं है, सिवा इनसानियत की ख़ुद की बेवकूफी।

source: مجھے تقدیر کی کیوں ضرورت ہوگی؟
es: ¿Para qué me sirve Taqdir?
fr: Pourquoi aurais-je besoin de taqdir ?
hi: मुझे तकदीर की क्यों ज़रूरत होगी।

source: کیا آپکو آب وہواکی تبدیلیوں کے کوائف درکار ہیں، ليکن نہيں جانتے کہ يہ کوائف کہاں سے ملیں گے؟
es: ¿Te servirían predicciones de cambios climáticos, pero no sabes dónde " "encontrar los datos?
fr: Avez-vous eu besoin d'utiliser des données de changements climatiques, mais vous ne saviez pas par où commencer ?
hi: क्या आपको जलवायु परिवर्तन के आँकड़े उपयोगी हैं, पर जानते नहीं कि ये आँकड़े कहाँ से मिलेंगी।

source: یا کیا آپکے پاس کوائف ہیں، ليکن ۱۰ مختلف جگہوں اور مختلف اوقات میں ہيں؟
es: O de pronto sí tienes datos, ¿pero en 10 archivos y formatos distintos?
fr: Ou peut-être que vous avez déjà trouvé des données, mais elles sont dans 10 endroits et formats différents ?
hi: या क्या आपके पास आँकड़े हैं, पर १० विभिन्न जगहों और प्रारूपों में हैं।

source: شاید مرکسم کا استعمال کرناچاہتے ہیں، ليکن دستی طريقے سے مرکسم کے۲۰۰ مسل کے نتائج پڑھناممکن نہیں لگ رہا؟
es: De pronto quieres utilizar Marksim, ¿pero no te dice mucho la idea de organizar a mano unos 200 archivos de resultados Marksim?
fr: Peut-être aimeriez-vous utiliser Marksim, mais vous n'avez pas trop le goût de gérer 200 fichiers de résultats à la main ?
hi: शायद मर्कसिम का प्रयोग करना चाहते हैं, पर हाथ से २०० दस्तावेज़ों के परिनाम पढ़ने मुमकिन नहीं लग रहा।

source: تقدیران تينوں معاملات میں سب آسانی مہيا کرتا ہے۔
es: Tranquilo, que Taqdir arreglará todo para ti.
fr: Taqdir réglera ces problèmes pour vous !
hi: तकदीर इन तिनों मामलों में सब असान कर देता है।

source: آپکے پاس کوائف نہیں ہیں؟ تقدیر انہیں آپکے لئے ڈھونڈ پايگا، چاھے کوائف ماضی، حال يا مستقبل کے ہوں۔
es: ¿No tienes datos? Taqdir los buscará para ti, que sean del pasado, presente o futuro.
fr: Vous n'avez pas de données ? Pas de problème ! Taqdir les trouvera pour vous, qu'il s'agisse du passé, du présent ou même du future.
hi: आपके पास आँकडे नहीं हैं क्या। तकदीर उनहें आपके लिये ढूंढ पाएगा, आँकड़े भूत, वर्तमान या भविश्य के हो।

source: آپکے پاس مختلف جگہوں اور مختلف اوقات میں کوائف ہیں؟ تقدیر انہیں پہلےمرحلے ميں جوڑدیگا اور دوسرے مرحلے میں نامعلوم دنوں کے کوائف آپکے لئے ڈھونڈیگا۔
es: ¿Tienes datos en varios formatos y archivos? Taqdir los combinará todos y después, si todavía faltan algunos datos, los buscará para ti.
fr: Vous avez des données, mais dans beaucoup de fichiers et beaucoup de formats différents ? Taqdir les combinera pour vous, et puis, s'il reste toujours des données manquantes, ira les rechercher pour vous aussi.
hi: आपके पास विभिन्न जगह और विभिन्न प्रारूपों में आँकड़े हैं क्या। तकदीर उनहें पहले में जोड़ा देगा और उसके बाद लापते दिनों के आँकड़ों आपके लिये ढूंढेगा।

source: آپکے پاس ماہانہ کوائف ہیں، ليکن آپکو روزانہ کی بنياد پر کوائف درکار ہيں؟ یا روزانہ ہیں پر ماہانہ چاہئيں؟ تقد ير اس سلسلے ميں بھی مددگار ہے۔
es: ¿Tienes datos mensuales pero quieres diarios? ¿O tienes datos diarios pero te sirven mensuales? Taqdir los procesarán como los quieres.
fr: Vous avez de données mensuelles, mais vous auriez besoin de données quotidiennes ? Ou peut-être s'agit-il de l'inverse ? Taqdir les convertira aussi pour vous.
hi: आपके पास महीने के आँकड़े हैं, पर रोज़ाना की तौर पर चाहिये क्या। या शायद रोज़ाने हैं पर महीने के रूप में चाहिये क्या। तकदीर इसमें भी आपकी मदद करेगा।

source: اشاریہ
es: Índice
fr: Index
hi: सूचकांक

source: اشاریہ اور جدول
es: Índice y tablas
fr: Index et tableaux
hi: सूचकांक और तालिके

source: :ref:`اشاریہ <genindex>`
es: :ref:`Índice <genindex>`
fr: :ref:`Index <genindex>`
hi: :ref:`तालिके <genindex>`

source: :ref:`کھوج <search>`
es: :ref:`Búsqueda<search>`
fr: :ref:`Recherche <search>`
hi: :ref:`खोज <search>`

source: مثال
hi: नमूना
