Repository: julienmalard/Marksim
Catalog: دستاویزات/source/_locale/*/LC_MESSAGES/malumat.po
Languages: es, fr, hi

source: معلومات
es: Referencia
fr: Information générale
hi: जानकारी

source: ذرائع
es: Fuentes
fr: Sources (`ذرائع`)
hi: स्रोत

source: تقدیر کے بنیادی ذرائع نیچے دیے گيے ہیں۔
es: Las fuentes disponibles en Taqdir se describen abajo.
fr: Les sources de données suivantes sont incluses avec taqdir.
hi: तकदीर के मूल स्रोतें निचे दिये गये हैं।

source: تقدیر کے بنیادی ذرائع
es: Fuentes de Taqdir
fr: Sources incluses avec taqdir
hi: तकदीर के मूल स्रोतें

source: ذریعہ
es: Fuente
fr: Source
hi: स्रोत

source: آب وہوا تبدیلی کے خاکے
es: Escenario de cambios climáticos
fr: Scénario de changements climatiques
hi: जलवायु परिवर्तन के परिदृश्य

source: دستیاب سال
es: Años disponibles
fr: Années disponibles
hi: उपलब्ध साल

source: ماضی
es: Pasado
fr: Passé
hi: भूत

source: ~۱۹۸۳ - آج
es: ~1983 - hoy
fr: ~1983 - présent
hi: ~१९८३ - आज

source: ۲۰۹۵ تک
es: Hacia 2095
fr: jusqu'à 2095
hi: २०९५ तक

source: اول الذکر ذرائع ماضی اور مستقبل کے لئے مفید ہیں۔ اگر آپ اپنے مشاہدات کے ساتھ کام کرنا چاہتے ہیں تو درجہ ذيل ذرائع کارآمد ہوسکتے ہیں يہ ذرائع مسل سے کوائف پڑھتے ہیں۔
es: Las fuentes arriba se emplean para obtener datos del pasado y del futuro. Si también tienes datos observados, las fuentes que siguen serán útiles porque pueden leer datos de archivos.
fr: Les sources ci-dessus sont utiles pour obtenir des données du passé et du future. Si vous avez aussi des données observées, les sources qui suivent ci-dessous vous seront probablement utiles, car elles peuvent lire des fichiers de données sur votre ordinateur.
hi: उपर दिये गए स्रोतें भूत और भविष्य के आँकड़ों पाने के लिये उपयोगी हैं। अगर आपके पास आँकड़े के प्रेक्षण हैं जिनके साथ काम करना है तो निचे दिये गए स्रोतें उपयोगी होंगे जो संचिका से आँकड़ों पढ़ते हैं।

source: :class:`~تقدیر.ذرائع.جےسن`: جےسن کے مسل پڑھتا ہیے۔
hi: :class:`~تقدیر.ذرائع.جےسن`: जेसान के संचिकों पढ़ता है।

source: :class:`~تقدیر.ذرائع.دیسات`: دیسات کے مسل پڑھتا ہیے۔
hi: :class:`~تقدیر.ذرائع.دیسات`: दीस्सात के संचिकों पढ़ता है।

source: :class:`~تقدیر.ذرائع.سی_اس_وی`: سے اس وی کع مسل پڑھتا ہیے۔
hi: :class:`~تقدیر.ذرائع.سی_اس_وی`: सी एस वी के संचिकों पढ़ता है।

source: :class:`~تقدیر.ذرائع.دیسات_ماھانہ`: دیسات کے ماھانہ کوائف پڑھتا ہیے۔
hi: :class:`~تقدیر.ذرائع.دیسات_ماھانہ`: दीस्सात के माहाना आँकड़ों पढ़ता है।

source: :class:`~تقدیر.ذرائع.جمع`: مختلف نکتے کے ذرائع ایک ساتھ جمع کرکے لاپتہ کوائف کی توسیع کریگا۔
hi: :class:`~تقدیر.ذرائع.جمع`: विभिन्न बिंदु के स्रोत एक साथ इकट्ठा करके अज्ञात आँकड़ों का विस्तार करेगा।

source: متغیّرات
es: Variables
fr: Variables
hi: परिवर्तनशील

source: تقدیر میں يہ متغیّرات دستیاب ہیں۔
es: Los variables siguientes están disponibles en Taqdir.
fr: Les variables suivantes sont disponibles dans taqdir.
hi: तकदीर में ये परिवर्तनशील उपलब्ध हैं।

source: احتیاط کریں ہو سکتا ہے کہ سارے ذرائع میں سارے متغیّرات دستیاب نہ ہوں۔
es: Notar que es posible que no todos los variables estén disponibles en todas las fuentes.
fr: Veuillez prendre note que toutes ces variables ne sont pas nécessairement disponibles dans toutes les sources.
hi: ख्याल रखिये के हो सकता है कि सारे स्रोतों में सारे परिवर्तनशील उपलब्ध नहीं हों।

source: نام
es: Nombre
fr: Nom
hi: नाम

source: معنی
es: Definición
fr: Définition
hi: मतलब

source: وحدت
es: Unidades
fr: Unité
hi: इकाइयाँ

source: تاریخ
es: Fecha
fr: Date
hi: तारीख़

source: روزانہ (``۲۰۱۸۰۱۰۱``)، ماہانہ (``۲۰۱۸۰۱``)، یا سالانہ (``۲۰۱۸``)
es: Diarios (``20180101``)، mensuales (``201801``)، o anuales (``2018``)
fr: Jour (``20180101``), mois (``201801``), ou année (``2018``)
hi: रोज़ाना (``२०१८०१०१``)، माहाना (``२०१८०१``)، या सालाना (``२०१८``)

source: بارش
es: Precipitación
fr: Précipitation
hi: बारिश

source: ملیمیٹر
es: mm
fr: mm
hi: मिलीमीटर

source: شمسی تابکاری
es: Radiación solar
fr: Radiation solaire
hi: सौर विकिरण

source: درجہ حرارت زیادہ سے زیادہ
es: Temperatura máxima
fr: Température maximale
hi: अधिकतम तापमान

source: سیلسیس
es: °C
fr: Centigrades
hi: सेंटीग्रेड

source: درجہ حرارت کم سے کم
es: Temperatura mínima
fr: Température minimale
hi: न्यूनतम तापमान

source: درجہ حرارت کا اوسط
es: Temperatura promedia
fr: Température moyenne
hi: औसत तापमान
