Repository: julienmalard/Marksim
Catalog: دستاویزات/source/_locale/*/LC_MESSAGES/shuruat.po
Languages: fr

source: ابتدايئہ
fr: Où commencer ?

source: تنصیب
fr: Installation

source: تقدیر کی تنصیب کرنا بہت اسان ہے۔
fr: C'est assez facile d'installer taqdir :

source: تازہ ترين تقدیر گٹھب پر دستياب ہے۔ اسے موصول کرنے کے ليے لکھيں:
fr: Vous pouvez aussi obtenir la version de taqdir en développement directement de GitHub :

source: تقدیر کیسے کام کرتا ہے؟
fr: Comment est-ce que ça fonctionne ?

source: اگر آپکے پاس مشاہدات ہیں تو کوائف ڈھونڈنے کی ترتیب کچھ اس طرح سے ہوگی۔ سب سے پہلے مطلوبہ جگہ پر لیے گئےآپکے اعدادوشمار، اس کے بعد ناساکے اعدادوشمار (ماضی کے لئے)اور سب سے آخر میں مرکسم کے اعدادوشمار(مستقبل کے لئے)۔
fr: Lors de la recherche de données, Taqdir cherchera d'abord les observations de l'endroit en question, ensuite les données de la NASA (pour le passé) et finalement les prédictions de Marksim (pour le future).

source: استعمال کرنے کا طريقہ؟
fr: Comment utiliser taqdir ?

source: پہلے ایک مقام بنانيں۔ يہ مطلوبہ جگہ کو ظاہر کرے گا جسکے ہمہیں کوائف چاییئں۔اس کے بعد مدت مت‏عيں کريں۔ تقدیر سے اسّے کوائف مل جائيں گے۔
fr: Il faut d'abord créer un endroit qui spécifie les coordonnées desquelles vous voulez obtenir vos données. Ensuite vous spécifiez les dates d'intérêt, et Taqdir générera les données pour vous.

source: from تقدیر.مقام import مقام میرا_مقام = مقام(‏عرض=11.02, طول=76.96, بلندی=1) کو = میرا_مقام.کوائف_پانا(سے='۲۰۱۷۰۱۰۱', تک='۲۰۱۸۰۱۰۱') کو.لاپتہ() # نامعلوم دنوں کے نام پانا کو.روزانہ() # روزانہ کوائف، پاندس میں # ماہانہ اور سالانہ کوائف کے ليے کو.ماہانہ() کو.سالانہ() # نتیجے کو مسل کے طور پر بھی لکھ سکتے ہیں۔ کو.لکھنا('/میرا/راستہ', '.csv')
fr: from تقدیر.مقام import مقام as endroit mon_endroit = endroit(چوڑائی=11.02, طول=76.96, بلندی=1) données = endroit.کوائف_پانا(سے='20170101', تک='20180101') données.لاپتہ() # obtenir les jours avec des données manquantes données.روزانہ() # données par jour, sous format pandas # On peut aussi obtenir des données mensuelles et annuelles. données.ماہانہ() données.سالانہ() # Et on peut aussi sauvegarder les résultats en tant que fichier. données.لکھنا('/mon/dossier', '.csv')

source: اگر آپکے پاس مشاہدات کے کوائف ہیں تو یہ بھی جوڑے جا سکتے ہیں۔
fr: Et, si vous avec des données observées, on peut bien sûr les ajouter aussi.

source: from تقدیر.مقام import مقام from تقدیر.ذرائع import سی_اس_وی میرا_مقام = مقام(‏عرض=11.02, طول=76.96, بلندی=1) مشاہدات = سی_اس_وی('مشاہدات.csv', عرض=11.02, طول=76.96, بلندی=1) کو = میرا_مقام.کوائف_پانا(سے='۲۰۱۸۰۱۰۱', تک='۲۰۱۷۰۱۰۱', ذرائع=مشاہدات)
fr: from تقدیر.مقام import مقام as endroit from تقدیر.ذرائع import سی_اس_وی as obs_csv mon_endroit = endroit(چوڑائی=11.02, طول=76.96, بلندی=1) obs = obs_csv('مشاہدات.csv', چوڑائی=11.02, طول=76.96, بلندی=1) données = mon_endroit.کوائف_پانا(سے='20180101', تک='20170101', ذرائع=obs)

source: مشاہدات کو ڈیسيٹ اور جےسن سے بھی پڑھا جا سکتا ہے۔
fr: On peut aussi obtenir les observations de fichiers de format JSON ou DSSAT.
