Repository: julienmalard/Marksim
Catalog: دستاویزات/source/_locale/*/LC_MESSAGES/nmune/mrksm5.po
Languages: fr, hi

source: مرکسم ۵ کا استعمال
fr: Utilisation avec Marksim 5
hi: मार्कसिम ५ के साथ प्रयोग

source: مرکسم ۵ آب وہوا کی تبدیلیوں کے خاکے کے لحاص سے آب وہوا کے کوائف دیتا ہے۔ مرکسم جالبین میں ہے اور آپ اسکو اپنے تخمینہ کار پر بھی تنصیب کر سکتے ہیں۔
fr: Marksim 5 est un programme qui calcule des prédictions climatiques selon un scénario de changements climatiques donné. Marksim est disponible en ligne et peut aussi être installé sur votre ordinateur.
hi: मार्कसिम ५ जलवायु परिवर्तन के परिदृश्य के अनुसार जलवायु के आँकड़ों देता है। मर्कसिम अंतरजल में है और आप उसको अपने संगणक पर भी स्थापित कर सकते हैं।

source: تقدیر دونوں سے کوائف ڈھونڈ سکتا ہے، پر تخمینہ کار پر موجود مرکسم ھمیشہ جالبین کے مرکسم سے تيز ہو گا۔ اسی لئے، اگر آپ مرکسم پر زيادہ کام کرنے والے ہیں،تو بہتر ہوگا کےآپ اپنے تخمینہ کار پر مرکسم تنصیب کریں۔
fr: Taqdir peut obtenir des données des deux. Cependant, la version de Marksim installée sur votre ordinateur sera toujours plus rapide que la version en ligne. Pour cette raison, si vous comptez faire utilisation régulière de Marksim, il est préférable de l'installer sur votre ordinateur.
hi: तकदीर दोनों से आँकड़ों ढूंढ सकता है, पर संगणक पर स्थापित होने वाला मार्कसिम हमेशा अंतरजल के मार्कसिम से तेज़ होगा। इसी लिये, अगर आप मर्कसिम पर बहुत काम करने वाले हैं, तो बहतर होगा के आप अपना संगणक पर मार्कसिम स्थापित करें।

source: جالبین مرکسم کا استعمال
fr: Utilisation avec Marksim en ligne
hi: अंतरजल मार्कसिम का प्रयोग

source: آپ کو کچھ کرنے کی ضرورت نہیں۔آّپ صرف مقام اور خاکوں کا ت‏عين کريں۔ اگر آپ کا تخمینہ کار جالبین سے منسلک ہے،تو تقدیر خود ہی اعدادوشمار لے گا۔
fr: Pas besoin de préparer quoi que ce soit. Vous n'avez qu'à sélectionner l'endroit et le scénario. Si votre ordinateur est connecté à l'internet, Taqdir ira chercher les données par lui-même.
hi: आपको कुछ भी करने की ज़रूरत नहीं। आप सिर्फ़ जगह और परिदृश्य निर्दिष्ट करें। अगर आप का संगणक अंतरजल से जुड़ा है, तो तकदीर खुद ही आँकड़ों लेगा।

source: تخمینہ کار پر مرکسم کا استعمال
fr: Utilisation avec Marskim local
hi: संगणक पर मार्कसिम का प्रयोग

source: پہلے مرحلہ ميں آپکو اپنے تخمینہ کار پرمرکسم کی تنصیب کرنی پڑیگی۔ بعد میں تقدیر کو مرکسم کا راستہ بتانا ہے تاکہ وہ جان سکے کہ آپکا مرکسم کہاں رکھا ہے:
fr: Vous devrez d'abord installer Marksim sur votre ordinateur, et ensuite dire à Taqdir où vous avez installé Marksim sur votre ordinateur pour qu'il puisse le trouver.
hi: पहला आपको मार्कसिम की स्थापित करनी पड़ेगा। बाद में तकदीर को मार्कसिम का रास्ता बताने पड़ेगा ताकि वह जान सकें के आपका मार्कसिम कहाँ रखा है।

source: from تقدیر.ذرائع.مرکسم۵ import راستہ_مرکسم_بتانا راستہ_مرکسم_بتانا('~میرا/مرکسم/ہے/یہاں/marksim.exe')
fr: from تقدیر.ذرائع.مرکسم۵ import راستہ_مرکسم_بتانا as obtenir_chemin_marksim obtenir_chemin_marksim('~mon/marksim/est/ici/marksim.exe')
hi: from تقدیر.ذرائع.مرکسم۵ import راستہ_مرکسم_بتانا as रास्ता_मार्कसिम_बताना रास्ता_मार्कसिम_बताना('~मेरा/मार्कसिम/है/यहाँ/marksim.exe')

source: مرکسم کے خاص نمونے
fr: Utilisation de modèles spécifiques
hi: मार्कसिम के विशेष प्रतिमान

source: مرکسم ۵ میں ۱۷ مختلف آب وہوا تبدیلیوں کے نمونے ہیں۔ عام طور پر ہم تمام کا استعمال کریں گے۔ پر اگر آپکو خاص نمونوں کا استعمال کرنا ہے تو آپ مرکسم کے ذریعے بتا سکتے ہیں کے آپکو کون سے نمونے درکار ہيں۔ یہ طريقہ جالبین اور تخمینہ کار کے مرکسم دونوں کے لئے کارآمد ہے۔
fr: Marksim 5 contient 17 différents modèles de changements climatiques. En général, nous utiliserons tous les 17 ensemble. Cependant, si vous préférez utiliser un sous-groupe de ces modèles, vous pouvez spécifiez à Taqdir lesquels vous voulez. Cette fonctionnalité existe tant pour la version internet de Marksim que pour la version installée sur votre ordinateur.
hi: मार्कसिम ५ में १७ विभिन्न जलवायु परिवर्तन के प्रतिमान हैं। आम तौर पर हम सारे का प्रयोग करेंगे। पर अगर आपको विशेष प्रतेमान का प्रयोग करना है तो आप मार्कसिम के स्रोत का बता सकते हैं के आपको कौनसे प्रतिमान चाहिये। यह विकल्प अंतरजल और संगणक के मार्कसिम दोनों के लिये उपलब्ध है।

source: from تقدیر.ذرائع import مرکسم۵, مرکسم۵_جال, ناسا from تقدیر.مقام import مقام میرا_مقام = مقام(عرض=11.02, طول=76.96, بلندی=1) نمونہ = '۰۰۰۰۰۱۰۰۰۰۰۰۰۰۰۰۰' ذرائع = (مرکسم۵(نمونہ=نمونہ), مرکسم۵_جال(نمونہ=نمونہ), ناسا()) کو = میرا_مقام.کوائف_پانا(سے='۲۰۵۰۰۱۰۱', تک='۲۰۶۰۰۱۰۱', ذرائع=ذرائع)
fr: from تقدیر.ذرائع import مرکسم۵ as Marksim5, مرکسم۵_جال as Marksim5Internet, ناسا as Nasa from تقدیر.مقام import مقام as endroit mon_endroit = endroit(عرض=11.02, طول=76.96, بلندی=1) modèles = '00000100000000000' sources = (Marksim5(نمونہ=modèles), Marksim5Internet(نمونہ=modèles), Nasa()) données = mon_endroit.کوائف_پانا(سے='20500101', تک='20600101', ذرائع=sources)
hi: from تقدیر.ذرائع import مرکسم۵ as मार्कसिम५, مرکسم۵_جال as मार्कसिम५अंतरजल, ناسا as नासा from تقدیر.مقام import مقام as जगह मेरा_जगह = जगह(عرض=11.02, طول=76.96, بلندی=1) प्रतिमान = '०००००१०००००००००००' स्रोतें = (मार्कसिम५(نمونہ=प्रतिमान), मार्कसिम५अंतरजल(نمونہ=प्रतिमान), नासा()) आँकड़ों = मेरा_जगह.کوائف_پانا(سے='२०५००१०१', تک='२०६००१०१', ذرائع=स्रोतें)
