Repository: julienmalard/Marksim
Catalog: دستاویزات/source/_locale/*/LC_MESSAGES/nmune/mshahdat.po
Languages: fr, hi

source: مشاہدات کی تياری
fr: Préparer les observations
hi: प्रेक्षण की तैयारी

source: اگر آپکے پاس آب وہوا کے مشاہدات ہیں، تقدیر ان سے کوائف لينے کی کوشش کریگا۔کوائف نہ ملنے کی صورت میں دوسرے ذرائع سے کوائف لےگا۔ آپ کے کوائف جیسن، سی اس وی یا ڈیسيٹ کے مطابق (``.WTH``) ہو سکتے ہیں۔
fr: Si vous avez des données de changements climatiques, Taqdir essayera de les utiliser en premier. S'il reste toujours des données manquantes, Taqdir les recherchera auprès d'autres sources de données. Les observations peuvent être en format json, csv ou DSSAT (``.WTH``).

source: from تقدیر.ذرائع import سی_اس_وی, ڈیسيٹ, جیسن from تقدیر.مقام import مقام جگہ = dict(عرض=11.02, طول=76.96, بلندی=1) مشاہدات۱ = سی_اس_وی('مشاہدات.csv', **جگہ) مشاہدات۲ = جیسن('مشاہدات.json', **جگہ) مشاہدات۳ = ڈیسيٹ('ACNM1301.WTH') م = مقام(**جگہ) م.کوائف_پانا(سے='۲۰۰۰۰۱۰۱', تک='۲۰۱۷۰۱۰۱', ذرائع=[مشاہدات۱, مشاہدات۲, مشاہدات۳], خاکے='۲۔۶')
fr: from تقدیر.ذرائع import سی_اس_وی as Csv, ڈیسيٹ as Dssat, جیسن as Json from تقدیر.مقام import مقام as Endroit coords = dict(عرض=11.02, طول=76.96, بلندی=1) Obs1 = Csv('Obs.csv', **coords) Obs2 = Json('Obs.json', **coords) Obs3 = Dssat('ACNM1301.WTH') endroit = Endroit(**coords) endroit.کوائف_پانا(سے='20000101', تک='20170101', ذرائع=[Obs1, Obs2, Obs3], خاکے='2.6')

source: کوائف ڈھونڈنے کی ترتیب کچھ اس طرح سے ہوگی۔ سب سے پہلے مطلوبہ جگہ پر لیے گئے اعدادوشمار، اس کے بعد ناساکے اعدادوشمار اور سب سے آخر میں مرکسم کے اعدادوشمار۔ اگر آپ نہیں چاہتے کہ نامعلوم کوائف دوسرے ذرائع سے ڈھونڈیں تو ذرائع توپل میں دینا:
fr: Lors de la recherche de données, Taqdir cherchera d'abord les observations de l'endroit en question, ensuite les données de la NASA et finalement les prédictions de Marksim. Si vous ne voulez pas que Taqdir aie rechercher les données manquantes auprès de ces autres sources de données, spécifiez les sources sous format d'un tuple :
hi: आँकड़ों ढूँढने का प्रक्रिया इस तरह से हागा। सब से पहले आवश्यक जगह पर लिये गए आपके आँकड़े, उस के बाद नासा के आँकड़े और सब से ख़त्म में मर्कसिम के आँकड़े। अगर आप नहीं चाहते के अज्ञात आँकड़ों दुसरे स्रोतों से ढूँढें तो स्रोतों तूपल में देना।

source: م = مقام(**جگہ) م.کوائف_پانا(سے='۲۰۰۰۰۱۰۱', تک='۲۰۱۷۰۱۰۱', ذرائع=(مشاہدات۱, مشاہدات۲, مشاہدات۳))
fr: mon_endroit = Endroit(**coords) mon_endroit.کوائف_پانا(سے='20000101', تک='20170101', ذرائع=(Obs1, Obs2, Obs3))

source: اب، نامعلوم کوائف کے جگہ میں ``np.nan`` ھی ہوگا۔
fr: Les données manquantes seront identifiées par ``np.nan``.
hi: अब, अज्ञात आँकड़ों के जगह में ``np.nan`` ही होगा।

source: اگر آپکے جیسن اور سی اس وی کےعمودی ستونوں کے نام :ref:`تقدیر کے متغیّرات کے نام <متغیّرات>` سے مختلف ہیں، تو کوئی مسئلہ نہیں ہے ۔
fr: Si les noms des colonnes dans votre json ou csv diffèrent des :ref:`noms officiels des variables <متغیّرات>` dans Taqdir, pas de problème non plus.
hi: अगर आपके जेसान और सी० एस० वी० के स्तंभ के नाम :ref:`तकदीर के परिवर्तनशील के नाम <متغیّرات>` से अलग हैं, ता कोई मुश्किल नहीं।

source: میرے_متغیّر_کا_نام = {'بارش': 'மழை'} سی_اس_وی('مشاہدات.csv', **جگہ, تبديل_ستون=میرے_متغیّر_کا_نام)
fr: mes_noms_de_variables = {'بارش': 'pluie'} Csv('Observations.csv', **endroit, تبديل_ستون=mes_noms_de_variables)
hi: मेरे_परिवर्तनशील_के_नाम = {'بارش': 'बारिश'} सी_एस_वी('प्रेक्षण.csv', **जगह, تبديل_ستون=मेरे_परिवर्तनशील_के_नाम)

source: ماہانہ اور سالانہ کے مشاہدات
fr: Observations mensuelles et annuelles
hi: माहाना और सालाना के प्रेक्षण

source: اگر آپکے مشاھدات ماہانہ یا سالانہ کی طرز پر ہیں،اور آپ کو روزانہ کی طرز پر کوائف چاہیں تو تقدیر آپکے لئے انسے روزانہ کی طرز پر کوائف بناے گا۔ تقدیر ڈیسيٹ کے ماہانہ کوائف کی مسل (``.MTH``) کو بھی پڑھ لیتا ہے۔
fr: Si vous avez des données en format mensuel ou annuel et vous les aimeriez en format quotidien, Taqdir pourra les transformer pour vous. Taqdir peut aussi lire le format de données mensuelles de DSSAT (``.MTH``).
hi: अगर आपके प्रेक्षण माहाना या सालाना की रूप में हैं, और आपको रोज़ाना की रूप में आँकड़े चाहिये तो तकदीर आपके लिये रोज़ाना की रूप पर आँकड़ों बनाएगा। तकदीर दीस्सात के माहाना आँकड़ोे की संचिके (``.MTH``) को भी पढ़ लेता है।

source: مشاہدات۱ = جیسن('ماہانہ.json', **جگہ) مشاہدات۲ = ڈیسيٹ('ARPE.MTH') م = مقام(**جگہ) م.کوائف_پانا(سے='۲۰۰۰۰۱۰۱', تک='۲۰۱۷۰۱۰۱', ذرائع=[مشاہدات۱, مشاہدات۲])
fr: Obs1 = Json('mensuel.json', **coords) Obs2 = DSSAT('ARPE.MTH') mon_endroit = Endroit(**coords) mon_endroit.کوائف_پانا(سے='20000101', تک='20170101', ذرائع=[Obs1, Obs2])

source: خاکے کے مشاہدات
fr: Observations de scénarios
hi: परिदृश्य के प्रेक्षण

source: عام طور پر، مشاہدات ماضی کے ھوتے ہیں۔ پر اگر آپکے پاس مستقبل کے کوائف ہیں، تو خاکے کے طور پر بھی مشاھدات بنا سکتے ہیں۔ اس طرخ کے مشاھدات اہم ہو سکتے ہیں جب آپکے پاس مطلوبہ جگہ کی آب وہواکی تبدیلی کے نمونے کے نتائج ہوں۔
fr: En général, les observations sont du passé. Cependant, si vous avez des données de prédictions futures, vous pouvez aussi spécifier le scénario de changements climatiques lors de la création d'observations. Cela peut être utile lorsque vous avez des prédictions d'un modèle climatique régional.
hi: आम तौर पर, प्रेक्षण भूत के होते हैं। पर अगर आपके पास भविष्य के आँकड़े हैं, तो परिदृश्य के तौर पर भी प्रेक्षण बना सकते हैं। उस तरह के प्रेक्षण महत्वपूर्ण हो सकते हैं जब आपके पास आवश्य जगह की जलवायु परिवर्तन के प्रतिमान के परिनाम हैं।

source: from تقدیر.ذرائع import سی_اس_وی from تقدیر.مقام import مقام جگہ = dict(عرض=11.02, طول=76.96, بلندی=1) مشاہدات_۲۶ = سی_اس_وی('مشاہدات.csv', **جگہ, خاکے='۲۔۶') مشاہدات_۸۵ = سی_اس_وی('مشاہدات.csv', **جگہ, خاکے='۸۔۵') م = مقام(**جگہ) # مشاہدات_۲۶ کے کوائف ھی ملیں گے۔ م.کوائف_پانا(سے='۲۰۱۸۰۱۰۱', تک='۲۰۱۷۰۱۰۱', ذرائع=[مشاہدات_۲۶, مشاہدات_۸۵], خاکے='۲۔۶') # مشاہدات_۸۵ کے کوائف ھی ملیں گے۔ م.کوائف_پانا(سے='۲۰۱۸۰۱۰۱', تک='۲۰۱۷۰۱۰۱', ذرائع=[مشاہدات_۲۶, مشاہدات_۸۵], خاکے='۸۔۵')
fr: from تقدیر.ذرائع import سی_اس_وی as Csv from تقدیر.مقام import مقام as Endroit coords = dict(عرض=11.02, طول=76.96, بلندی=1) Obs_26 = Csv('Obs.csv', **coords, خاکے='2.6') Obs_85= Csv('Obs.csv', **coords, خاکے='8.5') mon_endroit = Endroit(**coords) # Ne donnera que les données d'Obs_26 mon_endroit.کوائف_پانا(سے='20180101', تک='20170101', ذرائع=[Obs_26, Obs_85], خاکے='2.6') # Ne donnera que les données d'Obs_85 mon_endroit.کوائف_پانا(سے='20180101', تک='20170101', ذرائع=[Obs_26, Obs_85], خاکے='8.5')

source: اگر آپکے پاس آب وہوا کے مشاہدات ہیں، تقدیر ان سے کوائف لينے کی کوشش کریگا۔کوائف نہ ملنے کی صورت میں دوسرے ذرائع سے کوائف لےگا۔ آپ کے کوائف جےسن، سی اس وی یا دیسات کے مطابق (``.WTH``) ہو سکتے ہیں۔
hi: अगर आपके पास जलवायु के प्रेक्षण हैं, तकदीर उन से आँकड़ों लेने की कोशिश करेगा। आँकड़े न मेलें तो दुसरे स्रोत से आँकड़ों लेगा। आपके आँकड़े जेसान, सी० एस० वी० या दीस्सात (``.WTH``) के रूप में हो सकते हैं।

source: import matplotlib.pyplot as plt from تقدیر.ذرائع import سی_اس_وی, دیسات, جےسن from تقدیر.مقام import مقام from تقدیر.وسائل import وسائل_پانا جگہ = dict(عرض=47.275, طول=-77.617, بلندی=375) مشاہدات۱ = دیسات(وسائل_پانا('۳۶۵دن.WTG')) مشاہدات۲ = دیسات(وسائل_پانا('۳۶۶دن.WTG')) م = مقام(**جگہ) کو = م.کوائف_پانا(سے='۲۰۰۳۰۱۰۱', تک='۲۰۰۴۱۲۳۱', ذرائع=[مشاہدات۱, مشاہدات۲]) روزانہ = کو.روزانہ() روزانہ.dropna().plot(kind='line')
hi: import matplotlib.pyplot as plt from تقدیر.ذرائع import سی_اس_وی as सी_एस_वी, دیسات as दीस्सात, جیسن as जेसान from تقدیر.مقام import مقام as जगह from تقدیر.وسائل import وسائل_پانا निर्देशांत = dict(عرض=47.275, طول=-77.617, بلندی=375) प्रेक्षण१ = دیسات(وسائل_پانا('۳۶۵دن.WTG')) प्रेक्षण२ = دیسات(وسائل_پانا('۳۶۶دن.WTG')) मेरा_जगह = जगह(**निर्देशांत) आँ = मेरा_जगह.کوائف_پانا(سے='२००३०१०१', تک='२००४१२३१', ذرائع=[प्रेक्षण१, प्रेक्षण२]) रोज़ाना = आँ.روزانہ() रोज़ाना.dropna().plot(kind='line')

source: from تقدیر.ذرائع import سی_اس_وی, دیسات, جےسن from تقدیر.مقام import مقام from تقدیر.وسائل import وسائل_پانا مشاہدات۱ = سی_اس_وی(وسائل_پانا('روزانہ.csv'), **جگہ) مشاہدات۲ = جےسن(وسائل_پانا('روزانہ.json'), **جگہ) مشاہدات۳ = دیسات(وسائل_پانا('ACNM1301.WTH')) م = مقام(**جگہ) م.کوائف_پانا(سے='۲۰۰۰۰۱۰۱', تک='۲۰۱۷۰۱۰۱', ذرائع=(مشاہدات۱, مشاہدات۲, مشاہدات۳))
hi: from تقدیر.ذرائع import سی_اس_وی as सी_एस_वी, دیسات as दीस्सात, جیسن as जेसान from تقدیر.مقام import مقام as जगह from تقدیر.وسائل import وسائل_پانا as संसाधन_पाना प्रेक्षण१ = सी_एस_वी(संसाधन_पाना('روزانہ.csv'), **निर्देशांक) प्रेक्षण२ = जेसान(संसाधन_पाना('روزانہ.json'), **निर्देशांक) प्रेक्षण३ = दीस्सात(संसाधन_पाना('ACNM1301.WTH')) मेरा_जगह = जगह(**निर्देशांक) मेरा_जगह.کوائف_پانا(سے='२००००१०१', تک='२०१७०१०१', ذرائع=(प्रेक्षण१, प्रेक्षण२, प्रेक्षण३))

source: مشاہدات۱ = جیسن('ماہانہ.json', **جگہ) مشاہدات۲ = دیسات('ARPE.MTH') م = مقام(**جگہ) م.کوائف_پانا(سے='۲۰۰۰۰۱۰۱', تک='۲۰۱۷۰۱۰۱', ذرائع=[مشاہدات۱, مشاہدات۲])
hi: प्रेक्षण१ = जेसान('ماہانہ.json', **निर्देशंक) प्रेक्षण२ = दीस्सात('ARPE.MTH') मेरा_जगह = जगह(**निर्देशंक) मेरा_जगह.کوائف_پانا(سے='२००००१०१', تک='२०१७०१०१', ذرائع=[प्रेक्षण१, प्रेक्षण२])

source: from تقدیر.ذرائع import سی_اس_وی from تقدیر.مقام import مقام جگہ = dict(عرض=11.02, طول=76.96, بلندی=1) مشاہدات_۲۶ = سی_اس_وی('مشاہدات.csv', **جگہ, خاکے='۲.۶') مشاہدات_۸۵ = سی_اس_وی('مشاہدات.csv', **جگہ, خاکے='۸.۵') م = مقام(**جگہ) # مشاہدات_۲۶ کے کوائف ھی ملیں گے۔ م.کوائف_پانا(سے='۲۰۱۸۰۱۰۱', تک='۲۰۱۷۰۱۰۱', ذرائع=[مشاہدات_۲۶, مشاہدات_۸۵], خاکے='۲.۶') # مشاہدات_۸۵ کے کوائف ھی ملیں گے۔ م.کوائف_پانا(سے='۲۰۱۸۰۱۰۱', تک='۲۰۱۷۰۱۰۱', ذرائع=[مشاہدات_۲۶, مشاہدات_۸۵], خاکے='۸.۵')
hi: from تقدیر.ذرائع import سی_اس_وی as सी_एस_वी from تقدیر.مقام import مقام as जगह निर्देशांक = dict(عرض=11.02, طول=76.96, بلندی=1) प्रे_२६ = सी_एस_वी('प्रे.csv', **निर्देशांक, خاکے='२.६') प्रे_८५= सी_एस_वी('प्रे.csv', **निर्देशांक, خاکے='८.५') मेरा_जगह = जगह(**निर्देशांक) # सिर्फ़ प्रे_२६ के आँकड़ों देगा मेरा_जगह.کوائف_پانا(سے='२०१८०१०१', تک='२०१७०१०१', ذرائع=[प्रे_२६, प्रे_८५], خاکے='२.६') # सिर्फ़ प्रे_८५ के आँकड़ों देगा मेरा_जगह.کوائف_پانا(سے='२०१८०१०१', تک='२०१७०१०१', ذرائع=[प्रे_२६, प्रे_८५], خاکے='८.५')
