Repository: julienmalard/Marksim
Catalog: دستاویزات/source/_locale/*/LC_MESSAGES/trqi/nae_zrae.po
Languages: fr, hi

source: نئے ذرائع
fr: Nouvelles sources
hi: नये स्रोतें

source: اگر آپکو ايسی وضع کے کوائف استعمال کرنے ہیں جو ابھی تک تقدیر میں دستیاب نہیں ہیں، تو آپ اسکے لئے ایک نئے ذریعہ کی قسم بنا سکتے ہیں۔
fr: Si vous voulez utiliser des données dans un format qui n'est pas encore supporté par Taqdir, vous pouvez créer une nouvelle classe de source pour ce format.
hi: अगर आपको इसी रूप के आँकड़ों का प्रयोग करना है जो तकदीर में उपलब्ध नहीँ हैं, तो आप उसके लिये एक नये स्रोत के वर्ग बना सकते हैं।

source: تقدیر میں دو قسم کے ‍‌ذرائع ہیں، اعم ذرائع (:class:`~تقدیر.ذریعہ.ذریعہ`) اور نکتہ کے ذرائع (:class:`~تقدیر.ذریعہ_نکتہ.ذریعہ_نکتہ`)۔
fr: Il y a deux genres de source dans Taqdir, les sources générales (:class:`~تقدیر.ذریعہ.ذریعہ`) et les sources ponctuelles (:class:`~تقدیر.ذریعہ_نکتہ.ذریعہ_نکتہ`).
hi: तकदीर में २ प्रकार के स्रोत है, सामान्य स्रोत (:class:`~تقدیر.ذریعہ.ذریعہ`) और बिंदु के स्रोत (:class:`~تقدیر.ذریعہ_نکتہ.ذریعہ_نکتہ`)।

source: نکتہ کے ذرائع وہ ‌ذرائع ہیں جنکو بناتے پر ھی پتا ھو جاتا ہیے کے انکے کوائف نکشہ پر کس نکتے سے ایں گے۔ نکتہ کے ذرائے کا ایک نمونہ ہیے دیسات کے مسل کا ذریع، کیوں کے مسل میں ایک ہی جگہ کے کوائف رہتے ہیں۔ اعم ذرائع میں مختلف جگے کے کوائف دستیاب ہیں، جیسے کے مرکسم کا ذریع، جسے پوری دنیا کے کوائف ملی جا سکتے ہیں۔
fr: Les sources ponctuelles sont celles dont la position géographique doit être spécifié lors de leur initialisation. Un exemple d'une source ponctuelle serait la source pour les fichiers de DSSAT, dans lesquels sont spécifiés les coordonnées de l'endroit duquel proviennent les données. Au contraire, les sources générales peuvent contenir des données de multiples endroits, tel que la source pour Marksim, de laquelle peuvent être obtenues des données de tout le monde entier.
hi: बिंदु के स्रोतें वह स्रोतें हैं जिनको बनाते पर ही बता हो जाता है के उनके आँकड़े नक्षा पर किस बिंदु से आए हैं। बिंदु के स्रोत का एक नमूना है दीस्सात के संचिका का स्रोत, क्योंके संचिका में एक ही जगह के आँकड़े रहते हैं। सामान्य स्रोतों में विभिन्न जगह के आँकड़े उपलब्ध हैं, जैसे के मार्कसिम का स्रोत, जिससे पूरी दुनिया के आँकड़े मिले जा सकते हैं।

source: نئی قسم کے ليے، اعم ذریع ہو یا نکتہ کا بھی، آپکو ایک نيا فعل لکھنا پڑے گا: :meth:`~تقدیر.ذریعہ.ذریعہ._کوائف_بنانا`۔
fr: Lors du développement d'une nouvelle source, qu'elle soit générale ou ponctuelle, vous devrez implémenter une nouvelle fonction appelée :meth:`~تقدیر.ذریعہ.ذریعہ._کوائف_بنانا`.
hi: नये वर्ग के लिये, सामान्य स्रोत हो या बिंदु का भी, आपको :meth:`~تقدیر.ذریعہ.ذریعہ._کوائف_بنانا`۔ नाम का एक नया कार्य लिखना पड़ेगा।

source: اعم ذرائع
fr: Sources générales
hi: सामान्य स्रोतें

source: نمونے کے طور پر ناسا نام کے ذریعے کا :meth:`~تقدیر.ذریعہ.ذریعہ._کوائف_بنانا` نام کا فعل نیچے دیا گيا ہے۔
fr: En guise d'exemple, voici l'implémentation de la fonction :meth:`~تقدیر.ذریعہ.ذریعہ._کوائف_بنانا` pour la source NASA.
hi: नमूना के तौर पर, नासा के स्रोत का :meth:`~تقدیر.ذریعہ.ذریعہ._کوائف_بنانا` नाम का कार्य का कार्यान्वयन नीचे दीया गया है।

source: class ناسا(ذریعہ): def _کوائف_بنانا(خود, سے, تک, عرض, طول, بلندی, خاکے): try: ذریعہ_ناسا = NASAPowerWeatherDataProvider(latitude=عرض, longitude=طول, force_update=False) except (requests.exceptions.ConnectionError, KeyError, JSONDecodeError): return سے = max(ذریعہ_ناسا.first_date, سے) تک = min(ذریعہ_ناسا.last_date, تک) اعداد_پاندس = pd.DataFrame(columns=list(متغیرات), index=pd.period_range(سے, تک), dtype=float) ستون = { 'بارش': 'RAIN', 'شمسی_تابکاری': 'IRRAD', 'درجہ_حرارت_زیادہ': 'TMAX', 'درجہ_حرارت_کم': 'TMIN', 'درجہ_حرارت_اوسط': 'TEMP' } for تاریخ in اعداد_پاندس.index: for س, س_ناسا in ستون.items(): اعداد_پاندس.loc[تاریخ][س] = getattr(ذریعہ_ناسا(سے), س_ناسا) اعداد_پاندس.شمسی_تابکاری *= 1e-6 return اعداد_پاندس
fr: class Nasa(ذریعہ): def _کوائف_بنانا(soimême, سے, تک, عرض, طول, بلندی, خاکے): try: source_nasa = NASAPowerWeatherDataProvider(latitude=عرض, longitude=طول, force_update=False) except (requests.exceptions.ConnectionError, KeyError, JSONDecodeError): return de = max(source_nasa.first_date, de) à = min(source_nasa.last_date, à) données_pd = pd.DataFrame(columns=list(متغیرات), index=pd.period_range(de, à), dtype=float) colonnes = { 'بارش': 'RAIN', 'شمسی_تابکاری': 'IRRAD', 'درجہ_حرارت_زیادہ': 'TMAX', 'درجہ_حرارت_کم': 'TMIN', 'درجہ_حرارت_اوسط': 'TEMP' } for jour in données_pd.index: for col, col_nasa in colonnes.items(): données_pd.loc[jour][col] = getattr(source_nasa(de), col_nasa) données_pd.شمسی_تابکاری *= 1e-6 return données_pd
hi: class नासा(ذریعہ): def _کوائف_بنانا(खुद, سے, تک, عرض, طول, بلندی, خاکے): try: स्रोत_नासा = NASAPowerWeatherDataProvider(latitude=عرض, longitude=طول, force_update=False) except (requests.exceptions.ConnectionError, KeyError, JSONDecodeError): return से = max(स्रोत_नासा.first_date, से) तक = min(स्रोत_नासा.last_date, तक) आँकड़े_पांडास = pd.DataFrame(columns=list(متغیرات), index=pd.period_range(से, तक), dtype=float) स्तंभें = { 'بارش': 'RAIN', 'شمسی_تابکاری': 'IRRAD', 'درجہ_حرارت_زیادہ': 'TMAX', 'درجہ_حرارت_کم': 'TMIN', 'درجہ_حرارت_اوسط': 'TEMP' } for दिन in आँकड़े_पांडास.index: for स्तंभ, स्तंभ_नासा in स्तंभें.items(): आँकड़े_पांडास.loc[दिन][स्तंभ] = getattr(स्रोत_नासा(से), स्तंभ_नासा) आँकड़े_पांडास.شمسی_تابکاری *= 1e-6 return आँकड़े_पांडास

source: نکتہ کا ذرائع
fr: Sources ponctuelles
hi: बिंदू के स्रोतें

source: نکتہ کا ذرائع کو بناتے پر ھی بتانے پڑھتا ہیے کے کہاں کا ہیے اور کس خاکے سے۔ اسی لیے آپکا :meth:`~تقدیر.ذریعہ_نکتہ.ذریعہ_نکتہ._کوائف_بنانا` نام کا فعل میں تاریخ، عرض، طول، بلندی، یا خاکے کے بارے میں فکر کرنے کی ظرورت نہیں، ‎‎سرف دستیاب کوائف پاندس میں واپس دینا۔ تقدیر آپکے لیے تاریخ، جگہ اور خاکے کا جانچ کریگا۔
fr: Vous devez spécifier les coordonnées et le scénario d'une source ponctuelle lors de son instanciation. Pour cette raison, vous n'avez plus besoin de vous inquiéter de la date, de la latitude, de la longitude, de l'élévation ou du scénario dans votre implémentation de la méthode :meth:`~تقدیر.ذریعہ_نکتہ.ذریعہ_نکتہ._کوائف_بنانا` et vous pourrez simplement retourner toutes les données disponibles. Taqdir les filtrera ensuite automatiquement pour vous.
hi: बिंदु का स्रोत बनाते पर ही बताने पड़ता है के कहाँ का है और किस परिदृश्य से। इसी लिये आपका :meth:`~تقدیر.ذریعہ_نکتہ.ذریعہ_نکتہ._کوائف_بنانا` नाम का कार्य में तारीख़, अक्षाँश, देशाँतर उंचाई या परिदृश्य के बारे में फिकर करने की ज़रूरत नहीं, सिर्फ़ उपलब्ध आँकड़ों पांडस में वापस देना। तकदीर आपके लिये तारीख, जगह और परिदृश्य का परिक्षण करेगा।

source: نمونے کے طور پر جےسن نام کے ذریعے کا :meth:`~تقدیر.ذریعہ_نکتہ.ذریعہ_نکتہ._کوائف_بنانا` نام کا فعل نیچے دیا گيا ہے۔
fr: En guise d'exemple, voici l'implémentation de la fonction :meth:`~تقدیر.ذریعہ_نکتہ.ذریعہ_نکتہ._کوائف_بنانا` pour la source JSON.
hi: नमूने के तौर पर जेसान नाम के स्रोत का :meth:`~تقدیر.ذریعہ_نکتہ.ذریعہ_نکتہ._کوائف_بنانا` नाम का कार्य नीचे दीया गया है।

source: class جےسن(ذریعہ_نکتہ): def __init__(خود, مسل, عرض, طول, بلندی=None, خاکے=None, تبديل_عمودی_ستون=None): super().__init__(عرض, طول, بلندی, خاکے, تبديل_عمودی_ستون) if isinstance(مسل, str): ضابطہ = _ضابطہ_بندی(مسل) with open(مسل, 'r', encoding=ضابطہ) as م: خود.جےسن = json.load(م) else: خود.جےسن = مسل def _کوائف_بنانا(خود, سے, تک, عرض, طول, بلندی, خاکے): ستون_تاریخ = خود._نام_عمودی_ستون('تاریخ') اعداد_جےسن = pd.DataFrame( data={س: خود.جےسن[خود._نام_عمودی_ستون(س)] for س in متغیرات if خود._نام_عمودی_ستون(س) in خود.جےسن}, index=خود._اشاریہ_پانڈا_بنانا(خود.جےسن[ستون_تاریخ]) ) return اعداد_جےسن
fr: class Json(ذریعہ_نکتہ): def __init__(soimême, مسل, عرض, طول, بلندی=None, خاکے=None, تبديل_عمودی_ستون=None): super().__init__(عرض, طول, بلندی, خاکے, تبديل_عمودی_ستون) if isinstance(مسل, str): code = _ضابطہ_بندی(مسل) with open(مسل, 'r', encoding=code) as d: soimême.json= json.load(d) else: soimême.json = مسل def _کوائف_بنانا(soimême, سے, تک, عرض, طول, بلندی, خاکے): col_date = خود._نام_عمودی_ستون('تاریخ') données_json = pd.DataFrame( data={c: soimême.json[soimême._نام_عمودی_ستون(c)] for c in متغیرات if soimême._نام_عمودی_ستون(c) in soimême.json}, index=soimême._اشاریہ_پانڈا_بنانا(soimême.json[col_date]) ) return données_json
hi: class जेसान(ذریعہ_نکتہ): def __init__(खुद, مسل, عرض, طول, بلندی=None, خاکے=None, تبديل_عمودی_ستون=None): super().__init__(عرض, طول, بلندی, خاکے, تبديل_عمودی_ستون) if isinstance(مسل, str): कूटलेखन = _ضابطہ_بندی(مسل) with open(مسل, 'r', encoding=code) as सं: खुद.जेसान= json.load(d) else: खुद.json = مسل def _کوائف_بنانا(खुद, سے, تک, عرض, طول, بلندی, خاکے): स्तंभ_तारीख़ = खुद._نام_عمودی_ستون('تاریخ') जेसान_आँकड़े = pd.DataFrame( data={c: खुद.जेसान[खुद._نام_عمودی_ستون(स्त)] for स्त in متغیرات if खुद._نام_عمودی_ستون(c) in खुद.जेसान}, index=खुद._اشاریہ_پانڈا_بنانا(खुद.जेसान[स्तंभ_तारीख़]) ) return जेसान_आँकड़े
